[
  {
    "manga_id": 290,
    "title": "H.P. Lovecraft's The Colour out of Space",
    "descr": "An unnamed surveyor from Boston, telling the story in the first-person perspective, attempts to uncover the secrets behind a shunned place referred to by the locals of Arkham as the \"blasted heath.\"",
    "cover_image_url": "https://ononougi.com/thumbs/H.P. Lovecraft's The Colour out of Space/bc2f2082-9bdb-5a87-9a05-9fcd98cbb7cf.webp",
    "status": "Completed",
    "color": "#04aac7",
    "updated_at": "2025-07-15 00:03:38.086822+00",
    "created_at": "2025-07-15 00:01:50.092882+00",
    "mal_url": "https://myanimelist.net/manga/102161/Isekai_no_Shikisai"
  },
  {
    "manga_id": 39,
    "title": "Happiness",
    "descr": "Makoto Okazaki is an unpopular high school student who is frequently bullied by some of his classmates, being forced to act as their errand boy. But his life drastically changes one night when he is attacked by a mysterious girl, who plunges her teeth into his neck and begins drinking his blood. Upon satisfying her craving, she offers Makoto a simple choice: become like her or die.\n\nWhen he wakes up in a hospital after his encounter, Makoto is unable to deal with the blindingly bright lights and finds that water cannot quench his growing thirst.",
    "cover_image_url": "https://ononougi.com/thumbs/Happiness/914e16c3-ac42-5d93-a9d0-3e70941d25c0.webp",
    "status": "Completed",
    "color": "#3A4C96",
    "updated_at": "2025-05-24 19:33:37.436885+00",
    "created_at": "2025-05-24 18:38:58.936326+00",
    "mal_url": "https://myanimelist.net/manga/18301/Happiness"
  },
  {
    "manga_id": 187,
    "title": "Magi: The Labyrinth of Magic",
    "descr": "Fourteen years ago, mysterious buildings called Dungeons started to rise in various places around the world. Within these dungeons, powerful beings called djinns rule over them. When a person successfully conquers the dungeon, the djinn offers their immense strength in the form of Metal Vessels, recognizing him or her as a worthy king candidate. Adventurers from many empires and kingdoms venture into the dungeons in search of their bountiful treasures and the power of djinns. However, to travel through them is not an easy task, and only Magi—legendary magicians who choose kings and develop countries—can guide people through.\n\nAfter being trapped in a room for most of his life, a young Magi named Aladdin finally sets out on a journey to explore the world along with his friend, a djinn named Ugo, who he can summon from his flute. Through a series of fateful encounters, Aladdin meets new various friends and allies, and together they begin an adventure that will change the fate of the world.",
    "cover_image_url": "https://ononougi.com/thumbs/Magi The Labyrinth of Magic/273cb347-cefe-55e7-b92f-febee227d359.webp",
    "status": "Completed",
    "color": "#0988c0",
    "updated_at": "2025-06-18 18:59:32.587352+00",
    "created_at": "2025-06-18 18:00:25.685244+00",
    "mal_url": "https://myanimelist.net/manga/14790/Magi"
  },
  {
    "manga_id": 138,
    "title": "Initial D",
    "descr": "There is said to be a legendary \"Ghost of Akina\" that holds the fastest time to descend the Akina Pass. No one has ever come close to beating the record, nor has the mysterious driver of the white Toyota AE86 ever revealed themselves. Nowadays, the same AE86 can be seen every morning driving up and down the pass, making trips to a hotel residing at the top of the mountain.\n\nUnlike his classmates and coworkers, Takumi Fujiwara did not like cars. Any conversation about them would remind him of his early morning routine of delivering tofu for his father. He did not see the appeal in street racing and knew nothing about its rules or its culture. However, when tagging along to a nighttime meetup, the appearance of a rival racing team at the Akina Pass compels Takumi to hop behind the wheel of his father's AE86 and race them down the familiar mountain.\n\nThis spur-of-the-moment decision marks the beginning of Takumi's high-octane journey, shifting from his daily deliveries to becoming the greatest drift racer ever. Along the way, he slowly finds and kindles his love for street racing as he comes face-to-face with a plethora of opponents, each ready to take on the renowned Ghost of Akina.",
    "cover_image_url": "https://ononougi.com/thumbs/Initial D/01f3526b-8500-5754-81eb-c843697050ef.webp",
    "status": "Completed",
    "color": "#f1b322",
    "updated_at": "2025-06-12 20:01:00.18672+00",
    "created_at": "2025-06-12 18:04:50.457272+00",
    "mal_url": "https://myanimelist.net/manga/375/Initial_D"
  },
  {
    "manga_id": 230,
    "title": "Gantz",
    "descr": "Lonely high school student Kei Kurono isolates himself out of a growing cynicism toward his fellow man and the cruelty they are capable of enacting. One day, while waiting to take the subway to school, Kei's classmate Masaru Katou leaps onto the tracks in an effort to save a drunk man. Driven by an uncharacteristic desire to rescue someone else, Kei follows Katou down into danger. While successful in saving him, the two boys are killed by the train.\n\nKei wakes up beside Katou in an apartment full of strangers and furnished by a giant black orb with a glass-like outer surface. After finding out that everyone in the room has recently died, words appear on the black ball tasking them with killing a strange creature. The ball equips Kei and the others with power suits and mysterious guns before sending them off to collect this bizarre bounty.\n\nAlthough Kei discovers the mission to be far more deadly than originally suspected, he manages to survive. He is teleported back to the apartment where he and the other survivors are rewarded point values according to their actions in battle by the black sphere, which a fellow survivor says is called \"Gantz.\" Despite his death earlier that day, Kei is granted the ability to return to his daily life with one condition: he can be uprooted from his day at any time and summoned back to the apartment, where Gantz will task him and other recently deceased with the assassination of another target.\n\nWhile Katou dreads the inevitable return to Gantz, Kei finds himself living for the sole purpose of carrying out these missions. Thriving in the heat of battle and learning to care about himself and his comrades, Kei faces escalating monstrous threats that begin to bleed out into his normal life outside of Gantz.",
    "cover_image_url": "https://ononougi.com/thumbs/Gantz/d988a9db-d7d7-5c59-b839-3f78007bef11.webp",
    "status": "Completed",
    "color": "#c50202",
    "updated_at": "2025-06-21 18:49:49.371398+00",
    "created_at": "2025-06-21 17:54:49.757342+00",
    "mal_url": "https://myanimelist.net/manga/564/Gantz"
  },
  {
    "manga_id": 67,
    "title": "Slam Dunk",
    "descr": "Hanamichi Sakuragi, a tall, boisterous teenager with flame-red hair and physical strength beyond his years, is eager to put an end to his rejection streak of 50 and finally score a girlfriend as he begins his first year of Shohoku High. However, his reputation for delinquency and destructiveness precedes him, and most of his fellow students subsequently avoid him like the plague. As his first day of school ends, he is left with two strong thoughts: \"I hate basketball\" and \"I need a girlfriend.\"\n\nHaruko Akagi, ignorant of Hanamichi's history of misbehavior, notices his immense height and unwittingly approaches him, asking whether or not he likes basketball. Overcome by the fact that a girl is speaking to him, the red-haired giant blurts out a yes despite his true feelings. At the gym, Haruko asks if he can do a slam dunk. Though a complete novice, Hanamachi palms the ball and makes the leap...but overshoots, slamming his head into the backboard. Amazed by his near-inhuman physical abilities, Haruko quickly notifies the school's basketball captain of his feat. With this, Hanamichi is unexpectedly thrust into a world of competition for a girl he barely knows, but he soon discovers that there is perhaps more to basketball than he once thought.",
    "cover_image_url": "https://ononougi.com/thumbs/Slam Dunk/ee9f0f5b-e2c8-505b-9dc7-752953fa0415.webp",
    "status": "Completed",
    "color": "#bc102f",
    "updated_at": "2025-06-01 19:25:44.655251+00",
    "created_at": "2025-06-01 18:54:54.960745+00",
    "mal_url": "https://myanimelist.net/manga/51/Slam_Dunk"
  },
  {
    "manga_id": 40,
    "title": "Astra Lost in Space",
    "descr": "In the year 2063, mankind's domain stretches across the vast expanse of the universe. Eight students from Caird High School, along with a young child, embark for an exciting interstellar camp on the planet MCPA, which is located nine light-years from their home. Among them are the brave and athletic Kanata Hoshijima and the cute and bubbly Aries Spring.\n\nHowever, once the students arrive at MCPA, a strange ball of light starts chasing them. This mysterious sphere engulfs the students and sends them to a harrowing fate: a remote area of space located 5,012 light-years from safety. Hopelessly lost and quickly running out of resources, the students' only chance of returning home proves to be aboard a nearby abandoned spaceship, where their desperate fight for survival begins and the dark truths surrounding their deadly excursion are slowly revealed.",
    "cover_image_url": "https://ononougi.com/thumbs/Astra Lost in Space/b584f6e1-397b-51b3-b87e-07bb74275388.webp",
    "status": "Completed",
    "color": "#c84049",
    "updated_at": "2025-05-25 20:59:40.719362+00",
    "created_at": "2025-05-25 20:48:21.286948+00",
    "mal_url": "https://myanimelist.net/manga/98578/Kanata_no_Astra"
  },
  {
    "manga_id": 21,
    "title": "Noragami",
    "descr": "As a relatively unknown minor deity without any worshippers, Delivery God Yato takes on odd jobs for only five yen, with the goal of amassing a fortune large enough to buy himself a shrine. But in addition to obscurity, he has another problem: his Shinki, or weapon partner, has decided to resign, tired of being with a homeless god. Left with no weapon, Yato takes on more jobs, hoping to find a new partner soon.\nWhile out putting up fliers for a missing cat, Yato sees said cat and chases after him, right into the path of an oncoming vehicle. Hiyori Iki, a nearby girl, rushes to push Yato out of the way and ends up hurting herself. After waking up in the hospital, she discovers the incident has knocked her soul loose from her body. Realizing his actions caused this, Yato promises to help return Hiyori to normal—for five yen of course. But in order to return her to normal, he requires a new Shinki, which he finds in the rebellious spirit Yukine.\nNoragami tells the story of a girl walking the line between two worlds and a stray deity's quest for a place to call his own.",
    "cover_image_url": "https://ononougi.com/thumbs/Noragami/98a31b97-be65-512c-a605-9c9c9056b35c.webp",
    "status": "Completed",
    "color": "#3180b0",
    "updated_at": "2025-05-22 23:03:30.904451+00",
    "created_at": "2025-05-22 22:14:11.894519+00",
    "mal_url": "https://myanimelist.net/manga/24692/Noragami"
  },
  {
    "manga_id": 18,
    "title": "Oyasumi Punpun",
    "descr": "Punpun Onodera is a normal 11-year-old boy living in Japan. Hopelessly idealistic and romantic, Punpun begins to see his life take a subtle—though nonetheless startling—turn to the adult when he meets the new girl in his class, Aiko Tanaka. It is then that the quiet boy learns just how fickle maintaining a relationship can be, and the surmounting difficulties of transitioning from a naive boyhood to a convoluted adulthood. When his father assaults his mother one night, Punpun realizes another thing: those whom he looked up to were not as impressive as he once thought.\n\nAs his problems increase, Punpun's once shy demeanor turns into voluntary reclusiveness. Rather than curing him of his problems and conflicting emotions, this merely intensifies them, sending him down the dark path of maturity in this grim coming-of-age saga.",
    "cover_image_url": "https://ononougi.com/thumbs/Oyasumi Punpun/6c2f7c25-40cb-568a-bc86-09d871edc546.webp",
    "status": "Completed",
    "color": "#fed636",
    "updated_at": "2025-05-22 19:32:37.022187+00",
    "created_at": "2025-05-22 18:41:36.912233+00",
    "mal_url": "https://myanimelist.net/manga/4632/Oyasumi_Punpun"
  },
  {
    "manga_id": 41,
    "title": "Akame ga Kill!",
    "descr": "The ruthless Minister Honest exploits the ignorance of a new young Emperor and deviously rules the country from the shadows with twisted morals and no regard for human life. As a result of this, an epidemic of crime and corruption has spread throughout the country's capital city, and a state of society ensues where the privileged have absolute domination over the lesser.\n\nHowever, there exists an organization to combat this rife abuse of power: Night Raid, a secret division of the oppositionary Revolutionary Army. It is composed of a small team of ruthless assassins who murder all those who partake in or turn a blind eye to the Empire's outrageous wrongdoings.\n\nTatsumi is a naïve, sword-wielding young man on a journey to save his impoverished village. Soon, he witnesses the bloody horrors and cruelty of the capital firsthand. Overcome with hatred, Tatsumi is swayed by Night Raid's profound cause and decides to join them, embarking on a painful and dangerous mission to exact revenge on Minister Honest. Tatsumi gains many invaluable experiences as he unravels the ethics of conflicting ideologies, life and death, all while working toward the restoration of a humane world.",
    "cover_image_url": "https://ononougi.com/thumbs/Akame ga Kill!/9d3eb782-59c3-567a-acde-e59dceb7fab1.webp",
    "status": "Completed",
    "color": "#ba0d1d",
    "updated_at": "2025-05-25 21:53:50.489851+00",
    "created_at": "2025-05-25 21:35:25.533657+00",
    "mal_url": "https://myanimelist.net/manga/25132/Akame_ga_Kill"
  },
  {
    "manga_id": 13,
    "title": "Sousou no Frieren",
    "descr": "The Demon King has been defeated, and the victorious hero party returns home before disbanding. The four—mage Frieren, hero Himmel, priest Heiter, and warrior Eisen—reminisce about their decade-long journey as the moment to bid each other farewell arrives. But the passing of time is different for elves, thus Frieren witnesses her companions slowly pass away one by one.\n\nBefore his death, Heiter manages to foist a young human apprentice called Fern onto Frieren. Driven by the elf's passion for collecting a myriad of magic spells, the pair embarks on a seemingly aimless journey, revisiting the places that the heroes of yore had visited. Along their travels, Frieren slowly confronts her regrets of missed opportunities to form deeper bonds with her now-deceased comrades.",
    "cover_image_url": "https://ononougi.com/thumbs/Sousou no Frieren/8b9d1a68-82b8-533b-8a77-4e9c767f0729.webp",
    "status": "OnGoing",
    "color": "#CCD6DE",
    "updated_at": "2025-06-21 05:07:35.568062+00",
    "created_at": "2025-05-22 11:45:08.61143+00",
    "mal_url": "https://myanimelist.net/manga/126287/Sousou_no_Frieren"
  },
  {
    "manga_id": 17,
    "title": "Dandadan",
    "descr": "After being aggressively rejected, Momo Ayase finds herself sulking when she stumbles across a boy being bullied. Saved by her rash kindness, the occult-obsessed boy attempts to speak to her about supernatural interests he believes they share. Rejecting his claims, Ayase proclaimed that she instead is a believer in ghosts, starting an argument between the two over which is real.\n\nIn a bet to determine who is correct, the two decide to separately visit locations associated with both the occult and the supernatural—Ayase visiting the former and the boy visiting the latter. When the two reach their respective places, it turns out that neither was wrong and that both the occult and ghosts do exist.\n\nThis marks the beginning of Ayase and the boy's adventure, as they attempt to fix the surreal, supernatural, and occult elements around them to return to a normal life.",
    "cover_image_url": "https://ononougi.com/thumbs/Dandadan/555264e1-0f20-5892-ae05-229c13f85c2f.webp",
    "status": "OnGoing",
    "color": "#eadb1b",
    "updated_at": "2025-05-22 18:39:22.45171+00",
    "created_at": "2025-05-22 18:01:04.156586+00",
    "mal_url": "https://myanimelist.net/manga/135496/Dandadan"
  },
  {
    "manga_id": 94,
    "title": "Chainsaw Man",
    "descr": "Denji has a simple dream—to live a happy and peaceful life, spending time with a girl he likes. This is a far cry from reality, however, as Denji is forced by the yakuza into killing devils in order to pay off his crushing debts. Using his pet devil Pochita as a weapon, he is ready to do anything for a bit of cash.\n\nUnfortunately, he has outlived his usefulness and is murdered by a devil in contract with the yakuza. However, in an unexpected turn of events, Pochita merges with Denji's dead body and grants him the powers of a chainsaw devil. Now able to transform parts of his body into chainsaws, a revived Denji uses his new abilities to quickly and brutally dispatch his enemies. Catching the eye of the official devil hunters who arrive at the scene, he is offered work at the Public Safety Bureau as one of them. Now with the means to face even the toughest of enemies, Denji will stop at nothing to achieve his simple teenage dreams.",
    "cover_image_url": "https://ononougi.com/thumbs/Chainsaw Man/c22c8711-1b74-598d-b778-d47169bb8857.webp",
    "status": "OnGoing",
    "color": "#F55937",
    "updated_at": "2025-06-05 10:27:03.798163+00",
    "created_at": "2025-06-05 10:00:10.110958+00",
    "mal_url": "https://myanimelist.net/manga/116778/Chainsaw_Man"
  },
  {
    "manga_id": 16,
    "title": "Berserk",
    "descr": "Guts, a former mercenary now known as the Black Swordsman, is out for revenge. After a tumultuous childhood, he finally finds someone he respects and believes he can trust, only to have everything fall apart when this person takes away everything important to Guts for the purpose of fulfilling his own desires. Now marked for death, Guts becomes condemned to a fate in which he is relentlessly pursued by demonic beings.\n\nSetting out on a dreadful quest riddled with misfortune, Guts, armed with a massive sword and monstrous strength, will let nothing stop him, not even death itself, until he is finally able to take the head of the one who stripped him—and his loved one—of their humanity.",
    "cover_image_url": "https://ononougi.com/thumbs/Berserk/ef3c4765-b71f-5b45-bbb9-898b1288d8a9.webp",
    "status": "OnGoing",
    "color": "#bc3d47",
    "updated_at": "2025-06-23 12:28:30.49207+00",
    "created_at": "2025-05-22 15:18:19.264068+00",
    "mal_url": "https://myanimelist.net/manga/2/Berserk"
  },
  {
    "manga_id": 15,
    "title": "Domestic na Kanojo",
    "descr": "Natsuo Fujii is in love with his teacher, Hina. Attempting to forget his feelings towards her, Natsuo goes to a mixer with his classmates where he meets an odd girl named Rui Tachibana. In a strange turn of events, Rui asks Natsuo to sneak out with her and do her a favor. To his surprise, their destination is Rui's house—and her request is for him to have sex with her. There's no love behind the act; she just wants to learn from the experience. Thinking that it might help him forget about Hina, Natsuo hesitantly agrees.\n\nAfter this unusual encounter Natsuo now faces a new problem. With his father remarrying, he ends up with a new pair of stepsisters; unfortunately, he knows these two girls all too well. He soon finds out his new siblings are none other than Hina and Rui! Now living with both the teacher he loves and the girl with whom he had his \"first time,\" Natsuo finds himself in an unexpected love triangle as he climbs ever closer towards adulthood.",
    "cover_image_url": "https://ononougi.com/thumbs/Domestic na Kanojo/e58b9a8f-0432-5d9f-94d8-d5374bb97080.webp",
    "status": "Completed",
    "color": "#8AA3B9",
    "updated_at": "2025-05-22 15:15:25.666342+00",
    "created_at": "2025-05-22 13:07:45.633615+00",
    "mal_url": "https://myanimelist.net/manga/70941/Domestic_na_Kanojo"
  },
  {
    "manga_id": 68,
    "title": "Solanin",
    "descr": "Ever since graduating college, 23-year-old Meiko Inoue has believed in one thing: there is a demon lurking in Tokyo. This evil's presence has made her bored, aimless, and missing the excitement of her youth, leading her to contemplate what she truly seeks from life. Surprisingly enough, when Meiko proposes the idea of quitting her job to her boyfriend, Naruo Taneda, he groggily agrees.\n\nDeeply inspired by his half-asleep words of encouragement, Meiko hastily leaves her old life behind, looking to begin anew, with Taneda soon following suit. Together, they look toward their dreams from their college days and decide to revive Rotti, Taneda's old band. As the two stand confidently alongside their old friends with instruments in hand, life throws the most unexpected curveball their way, leaving Meiko and her friends to pick up the pieces of what was shattered.\n\nSolanin tells an intimate story about the trials and tribulations of love, loss, and grief centered around people in their twenties who often slip between the cracks of society.",
    "cover_image_url": "https://ononougi.com/thumbs/Solanin/f82da70c-5e5d-54f8-a0f2-5d8d97821157.webp",
    "status": "Completed",
    "color": "#bb9a60",
    "updated_at": "2025-06-01 23:46:59.916779+00",
    "created_at": "2025-06-01 23:41:23.571703+00",
    "mal_url": "https://myanimelist.net/manga/3731/Solanin"
  },
  {
    "manga_id": 254,
    "title": "Sono Bisque Doll wa Koi wo Suru",
    "descr": "Engrossed in the family business of traditional doll making, Wakana Gojou is a reserved high school freshman without friends. Harboring painful memories of a childhood friend's disdain toward his interest, Gojou cannot relate to his classmates and their pastimes, eventually isolating himself.\n\nGojou has yet to perfect his crafting of dolls' faces, but is exceptionally skilled at making their clothes. His finesse with the sewing machine is soon discovered by his beautiful classmate Marin Kitagawa, whose boldness and honesty Gojou both admires and envies. Instantly, she shares with Gojou her own hobby: she likes to cosplay as characters from erotic video games.\n\nHowever, Kitagawa cannot sew her own costumes, leading her to seek Gojou's expertise. Now, as he is dragged along to the charming girl's endless cosplay-related affairs, Kitagawa becomes his first friend who fully accepts him. Thus, although polar opposites, their relationship slowly blossoms through their aptitude in helping each other in the intricate world of cosplay.",
    "cover_image_url": "https://ononougi.com/thumbs/Sono Bisque Doll wa Koi wo Suru/78a7ffae-c5f3-590c-9c18-5a52cfcaa45a.webp",
    "status": "OnGoing",
    "color": "#f1a645",
    "updated_at": "2025-07-01 20:58:43.113188+00",
    "created_at": "2025-07-01 20:38:04.197531+00",
    "mal_url": "https://myanimelist.net/manga/112268/Sono_Bisque_Doll_wa_Koi_wo_Suru"
  },
  {
    "manga_id": 139,
    "title": "Kimi no Koto ga Daidaidaidaidaisuki na 100-nin no Kanojo",
    "descr": "Upon graduating middle school, Rentarou Aijou manages to confess to the girl he loves. Unfortunately, he gets rejected, making it his 100th rejection in a row. Having experienced heartbreak after heartbreak, he goes to a matchmaking shrine and prays with the hope of finally getting a girlfriend in high school. Suddenly, the god of the shrine appears, promising Rentarou that he will meet one hundred soulmates in high school.\n\nAlthough skeptical at first, Rentarou quickly acknowledges the truth behind the god's words when two of his soulmates—Hakari Hanazono and Karane Inda—confess to him the very same day that they meet him. However, there was one detail that the god forgot to tell Rentarou: if any of his soulmates fails to get into a relationship with him, they will die. Now trapped in a matter of life and death, Rentarou decides to date all of his soulmates.\n\nWith a heart so big that it can be shared among one hundred girlfriends, Rentarou makes the most out of his unanticipated high school life, with the Rentarou family growing ever larger!",
    "cover_image_url": "https://ononougi.com/thumbs/Kimi no Koto ga Daidaidaidaidaisuki na 100-nin no Kanojo/6424a777-f6b8-5bf3-87ab-b5cc9c2d3197.webp",
    "status": "OnGoing",
    "color": "#ba496b",
    "updated_at": "2025-06-12 21:10:11.451004+00",
    "created_at": "2025-06-12 20:38:20.153326+00",
    "mal_url": "https://myanimelist.net/manga/123681/Kimi_no_Koto_ga_Daidaidaidaidaisuki_na_100-nin_no_Kanojo"
  },
  {
    "manga_id": 210,
    "title": "Gantz:G",
    "descr": "A group of high school students have an accident on their trip and all of them die, but they find themselves in a classroom with a black sphere instead...",
    "cover_image_url": "https://ononougi.com/thumbs/GantzG/4b7d4b6a-8915-5e84-b175-6ca8cc4e218d.webp",
    "status": "Completed",
    "color": "#b21f20",
    "updated_at": "2025-06-20 00:18:10.551088+00",
    "created_at": "2025-06-20 00:14:19.851378+00",
    "mal_url": "https://myanimelist.net/manga/93677/Gantz_G"
  },
  {
    "manga_id": 69,
    "title": "Pluto",
    "descr": "Famous for his military service in the 39th Asian War, the legendary Swiss robot Montblanc is violently murdered. Humans and robots around the world mourn for the beloved celebrity. Montblanc's popularity only grew in the years following the war, thanks to his dedication to nature conservation and his loving personality.\n\nFellow war veteran and robotic Europol detective Gesicht is sent to investigate Montblanc's tragic demise. In his pursuit, Gesicht uncovers evidence of a mysterious entity known only as \"Pluto.\" He also learns of a conspiratorial plot to dismantle the eight specialized robots from around the world who participated in the war. Racing against time to save those who still remain, Gesicht grapples with his memory, morality, and a world full of hate, desperately attempting to defend the fragile coexistence of man and machine.",
    "cover_image_url": "https://ononougi.com/thumbs/Pluto/d3acb340-7f86-52f8-8eff-afbb5a5857c2.webp",
    "status": "Completed",
    "color": "#d7a579",
    "updated_at": "2025-06-02 00:16:02.925476+00",
    "created_at": "2025-06-01 23:55:54.732399+00",
    "mal_url": "https://myanimelist.net/manga/745/Pluto"
  },
  {
    "manga_id": 56,
    "title": "Parasyte",
    "descr": "\"Parasites\" are tennis ball sized creatures, whose numbers and origins are unknown. They invade and take over the human mind in order to survive. Shinichi Izumi is a 16-year-old high school student who lives with his parents in a quiet neighborhood. One night, a Parasite invades Shinichi's body in an attempt to take control of it. However, it fails to complete the takeover process and ultimately ends up inhabiting only his right arm.\n\nThus, both Shinichi and the Parasite—who calls himself Migi—retain their individual minds. Now in a peculiar \"human and alien\" relationship, Migi proposes that they cooperate to survive. Shinichi has no choice but to agree, and he must now cling to his morality as he and Migi face off against other bloodthirsty Parasites.",
    "cover_image_url": "https://ononougi.com/thumbs/Parasyte/82f228cd-f89b-5d6d-931a-7a4aae48e327.webp",
    "status": "Completed",
    "color": "#e65e3e",
    "updated_at": "2025-05-28 12:22:48.522366+00",
    "created_at": "2025-05-28 12:09:21.08735+00",
    "mal_url": "https://myanimelist.net/manga/401/Kiseijuu"
  },
  {
    "manga_id": 77,
    "title": "Kakegurui Twin",
    "descr": "As a first-year student of the renowned Hyakkaou Private Academy, Mary Saotome knows her future is set for a one-way cruise to the top...\n\nThat is, until an encounter with an old-classmate-turned-housepet throws the newbie princess into the world of gambling! Can a normal girl like Mary make friends and survive debtless through only wit and luck? Find out in this prequel to the mega-popular Kakegurui!",
    "cover_image_url": "https://ononougi.com/thumbs/Kakegurui Twin/148f98f0-00d9-5300-a86a-f3f512c538b0.webp",
    "status": "Completed",
    "color": "#fbd570",
    "updated_at": "2025-06-02 21:48:31.322837+00",
    "created_at": "2025-06-02 21:33:05.902256+00",
    "mal_url": "https://myanimelist.net/manga/95347/Kakegurui_Twin"
  },
  {
    "manga_id": 43,
    "title": "Tomie",
    "descr": "In a high school classroom, students mourn the loss of one of their own: Tomie Kawakami, who has been murdered and dismembered. Shocked by the announcement of her death, the class is puzzled by the cruel fate that has befallen someone so dear to them; such a radiant and beautiful girl did not deserve such a hideous demise. However, a strikingly familiar student suddenly appears at the classroom's entrance. Gorgeous, slender, and with a beauty mark under her left eye, Tomie smiles and apologizes for being late.\n\nBut this is just the beginning of the mysteries surrounding this seemingly inhuman woman. The men unlucky enough to catch her eye become smitten with her instantly, but also become driven by a dark impulse to dismember her, one they often succumb to. And each time, Tomie returns from the dead to continue her favorite pastime: toying with men.",
    "cover_image_url": "https://ononougi.com/thumbs/Tomie/2d74e6dd-12af-5c59-a5d6-dd0f5210a92f.webp",
    "status": "Completed",
    "color": "#ce282f",
    "updated_at": "2025-05-26 00:04:19.676113+00",
    "created_at": "2025-05-25 23:51:48.546075+00",
    "mal_url": "https://myanimelist.net/manga/912/Tomie"
  },
  {
    "manga_id": 44,
    "title": "Gyo",
    "descr": "When diver Tadashi and his girlfriend Kaori Sawahara take a trip to the coast of Okinawa, they find that their strained relationship is the least of their worries when they unwittingly witness the start of the apocalypse. Attacked by a strange, four-legged fish in their cabin, they manage to kill it, but are left unsettled by the putrid stench it carried—the haunting smell of death.\n\nThis lone assault is only the herald of what's to come, as soon, many more such creatures emerge from the sea, attacking anything in their path. Though Tadashi and Kaori quickly return to Tokyo, they find there is no longer any safe haven; no matter where they run, the death stench creeps...",
    "cover_image_url": "https://ononougi.com/thumbs/Gyo/e4a5f56a-c737-5225-9537-7661a3c25732.webp",
    "status": "Completed",
    "color": "#bf2f37",
    "updated_at": "2025-05-26 21:57:29.612852+00",
    "created_at": "2025-05-26 21:54:32.670573+00",
    "mal_url": "https://myanimelist.net/manga/909/Gyo__Ugomeku_Bukimi"
  },
  {
    "manga_id": 70,
    "title": "Eden: It's an Endless World!",
    "descr": "In the panic surrounding a worldwide pandemic which kills 15 percent of the population and cripples many more, a secret organization, the Propater, topples the UN and seizes control of much of the world. A boy and a girl, raised in an abandoned virology research center, immune to the virus, are attacked by the Propater and escape.\n\nTwenty years later, the boy is the most powerful drug lord in South America. He aids his son from behind the scenes as he evades and eventually with the help of mercenaries from Nomad (some of them former Propater operatives) fights the Propater. As the plot develops focus shifts away from the main character and develops many sub-plots dedicated to terrorism, Human-improvement, the struggle of the developing countries and the power battles between the drug cartels and Propater.\n\nBased strongly on Gnostic mythology, all major characters are named after gnostic deities, and have analogous roles.",
    "cover_image_url": "https://ononougi.com/thumbs/Eden It's an Endless World!/be165da2-99db-5b8c-978f-8574ae9067bb.webp",
    "status": "Completed",
    "color": "#e3520b",
    "updated_at": "2025-06-02 01:08:01.116158+00",
    "created_at": "2025-06-02 00:28:46.612791+00",
    "mal_url": "https://myanimelist.net/manga/731/Eden__Its_an_Endless_World"
  },
  {
    "manga_id": 78,
    "title": "Bakuman",
    "descr": "Despite being a talented artist, middle school student Moritaka Mashiro is unsure about his future, accepting that he will simply lead a normal life. After seeing one of Mashiro's drawings in class, Akito Takagi—an aspiring writer—insists that they write a manga together. But Mashiro is hesitant—his uncle, a mangaka, had died from overworking just a few years prior. However, when Mashiro hears that his crush, Miho Azuki, aims to be a voice actress, he becomes determined to create a manga that can be adapted into an anime for her to star in. Reciprocating Mashiro's feelings, she agrees to get married once they have both achieved their dreams.\n\nBakuman. chronicles Mashiro and Takagi's successes and struggles in their attempts to be serialized in Weekly Shounen Jump and become famous mangakas. Will their gamble pay off, or will they join the countless number of failures?",
    "cover_image_url": "https://ononougi.com/thumbs/Bakuman/504b3523-639a-5d22-8373-4d58bb5d7992.webp",
    "status": "Completed",
    "color": "#5790b3",
    "updated_at": "2025-06-02 23:52:24.723906+00",
    "created_at": "2025-06-02 23:15:57.531856+00",
    "mal_url": "https://myanimelist.net/manga/9711/Bakuman"
  },
  {
    "manga_id": 97,
    "title": "Cardcaptor Sakura",
    "descr": "\"Herein lie the Clow Cards—if their seal is broken, disaster shall befall this world...\"\n\nSakura Kinomoto is an energetic and sweet 10-year-old girl attending Tomoeda Elementary School. One day not long after entering the fourth grade, Sakura finds a mysterious book titled The Clow hidden within her father's bookshelves. Upon opening it, a small, winged creature with an Osakan accent comes out of the book and introduces itself as Keroberos, the Creature of the Seal who guards magical cards known as the Clow Cards and keeps them from escaping the book.\n\nUnfortunately for the plushy guardian, it seems that the Clow Cards have already escaped—and now Sakura is tasked with capturing them before the cards unleash their powers and cause havoc all over Tomoeda! With the support of the tiny guardian who she nicknames \"Kero\" and her best friend, Tomoyo Daidouji, Sakura must wield a magical bird-shaped key and use her new powers as the Cardcaptor to maintain peace and ensure that everything is alright.",
    "cover_image_url": "https://ononougi.com/thumbs/Cardcaptor Sakura/3d8143d0-d9e0-589c-9f89-3a1e65b870a2.webp",
    "status": "Completed",
    "color": "#F9C0AF",
    "updated_at": "2025-06-05 11:17:49.411403+00",
    "created_at": "2025-06-05 10:55:36.754379+00",
    "mal_url": "https://myanimelist.net/manga/106/Cardcaptor_Sakura"
  },
  {
    "manga_id": 58,
    "title": "Yesterday wo Utatte",
    "descr": "Fresh out of college, Rikuo Uozumi sees little point in pursuing any particular career. Instead, he works part-time in a convenience store while struggling to pay his bills. But his humdrum routine soon changes with the unexpected appearance of two women: Shinako Morinome, a former classmate that Rikuo is still in love with, and Haru Nonaka, an odd high school dropout with a crow as her pet.\n\nThough Rikuo hopes that his genuine feelings will reach Shinako, she herself battles a personal matter that has closed off her heart to love. Meanwhile, the bright and lively Haru is upfront about her growing infatuation with Rikuo. Despite everything, Rikuo tries to maintain the flow of his slow days; however, with Haru around, peace and quiet is never an option—and he might just start to enjoy the change in pace.",
    "cover_image_url": "https://ononougi.com/thumbs/Yesterday wo Utatte/0c50ed1a-9b42-5948-a1e3-94c7ba3da030.webp",
    "status": "Completed",
    "color": "#68664D",
    "updated_at": "2025-05-29 00:34:44.986192+00",
    "created_at": "2025-05-29 00:20:54.142037+00",
    "mal_url": "https://myanimelist.net/manga/1155/Yesterday_wo_Utatte"
  },
  {
    "manga_id": 243,
    "title": "Kobayashi-san Chi no Maid Dragon",
    "descr": "For Kobayashi, every workday is the same tiring routine, followed by a night of drinking with coworkers to let herself loose. However, her stale life changes one morning when she is greeted at her front door by the huge face of a dragon. Introducing herself as Tooru, the dragon transforms into a young woman in a maid outfit. Having met Kobayashi drunk in the mountains the night before, she accepts Kobayashi's invitation to live with her as her personal housemaid.",
    "cover_image_url": "https://ononougi.com/thumbs/Kobayashi-san Chi no Maid Dragon/6dc04b97-5d40-53d6-b39e-140384f5187e.webp",
    "status": "OnGoing",
    "color": "#40a435",
    "updated_at": "2025-06-23 14:21:39.882109+00",
    "created_at": "2025-06-23 13:57:58.6072+00",
    "mal_url": "https://myanimelist.net/manga/80119/Kobayashi-san_Chi_no_Maid_Dragon"
  },
  {
    "manga_id": 23,
    "title": "Kimetsu no Yaiba",
    "descr": "Tanjirou Kamado lives with his impoverished family on a remote mountain. As the oldest sibling, he took upon the responsibility of ensuring his family's livelihood after the death of his father. On a cold winter day, he goes down to the local village in order to sell some charcoal. As dusk falls, he is forced to spend the night in the house of a curious man who cautions him of strange creatures that roam the night: malevolent demons who crave human flesh.\nWhen he finally makes his way home, Tanjirou's worst nightmare comes true. His entire family has been brutally slaughtered with the sole exception of his sister Nezuko, who has turned into a flesh-eating demon. Engulfed in hatred and despair, Tanjirou desperately tries to stop Nezuko from attacking other people, setting out on a journey to avenge his family and find a way to turn his beloved sister back into a human.",
    "cover_image_url": "https://ononougi.com/thumbs/Kimetsu no Yaiba/653b6e14-f333-5e01-b948-1f37cc1f4e34.webp",
    "status": "Completed",
    "color": "#b7151a",
    "updated_at": "2025-06-21 21:17:29.853182+00",
    "created_at": "2025-05-22 23:34:23.040757+00",
    "mal_url": "https://myanimelist.net/manga/96792/Kimetsu_no_Yaiba"
  },
  {
    "manga_id": 79,
    "title": "Lycoris Recoil",
    "descr": "For these peaceful days―there's a secret behind it all. A secret organization that prevents crimes: \"DA - Direct Attack.\" And their group of all-girl agents: \"Lycoris.\" This peaceful everyday life is all thanks to these young girls. The elite Chisato Nishikigi is the strongest Lycoris agent of all time. Alongside is Takina Inoue, the talented but mysterious Lycoris. They work together at one of its branches―Café LycoReco.\n\nHere, the orders this café takes range from coffee and sweets to childcare, shopping, teaching Japanese to foreign students, etc. It's mostly tasks unbefitting of Lycoris. The free-spirited and optimistic pacifist, Chisato. And the cool-headed and efficient Takina. The chaotic everyday lives of this mismatched duo begin!",
    "cover_image_url": "https://ononougi.com/thumbs/Lycoris Recoil/9c410ce2-8a77-533f-a630-33b0987c0da7.webp",
    "status": "OnGoing",
    "color": "#e24953",
    "updated_at": "2025-06-03 00:01:24.371573+00",
    "created_at": "2025-06-02 23:59:58.348037+00",
    "mal_url": "https://myanimelist.net/manga/150973/Lycoris_Recoil"
  },
  {
    "manga_id": 141,
    "title": "Dungeon Meshi",
    "descr": "After the Golden Kingdom is sunk underground by an insane magician, its king emerges, promising all of his treasure to any who defeat the magician, before crumbling to dust. Guilds are spurred on by this promise, traversing the labyrinthine dungeon in search of the magician. Laios Touden, the leader of one such guild, encounters a dragon that wipes out his party and devours his sister, Falin. Despite having lost the entirety of their supplies and belongings, Laios along with Marcille Donato, an elven healer, and Chilchuck Tims, a halfling thief, immediately reenter the dungeon, determined to save Falin.\n\nTime being of the essence, Laios suggests the taboo of eating the monsters of the dungeon as a means of gathering supplies. Upon the preparation of their first meal in the dungeon, they are stopped by an on-looking dwarf named Senshi. An enthusiast of monster cooking, he helps them prepare their monster ingredients for safe consumption. After learning of Laios' circumstances, Senshi expresses his desire to cook a dragon and joins their guild, thus beginning their food-filled foray into the dungeon together.",
    "cover_image_url": "https://ononougi.com/thumbs/Dungeon Meshi/f72a6b81-fecc-5a39-badc-cfdb84194e79.webp",
    "status": "Completed",
    "color": "#96382e",
    "updated_at": "2025-06-13 22:53:48.13262+00",
    "created_at": "2025-06-13 22:38:40.563575+00",
    "mal_url": "https://myanimelist.net/manga/85781/Dungeon_Meshi"
  },
  {
    "manga_id": 244,
    "title": "Historie",
    "descr": "Alexander the Great is a name known around the world as belonging to one of the greatest military commanders in history. But due to the grandeur of his name and enormity of his achievements, his right-hand man Eumenes remains a lesser-known historical figure. Eumenes led a turbulent life, overcoming numerous struggles and traveling great distances to meet and befriend many of the most influential names of his time.\n\nOne does not become the right hand of Alexander the Great by mere birth. Eumenes fought for his position with fierce talent, intellect, and confidence. This is his story.",
    "cover_image_url": "https://ononougi.com/thumbs/Historie/a54654ab-210f-553b-9037-3f7a659fd9ca.webp",
    "status": "OnGoing",
    "color": "#85bbd8",
    "updated_at": "2025-06-23 17:01:37.345597+00",
    "created_at": "2025-06-23 16:45:29.402634+00",
    "mal_url": "https://myanimelist.net/manga/2924/Historie"
  },
  {
    "manga_id": 28,
    "title": "Uzumaki",
    "descr": "In the town of Kurouzu-cho, Kirie Goshima lives a fairly normal life with her family. As she walks to the train station one day to meet her boyfriend, Shuuichi Saito, she sees his father staring at a snail shell in an alley. Thinking nothing of it, she mentions the incident to Shuuichi, who says that his father has been acting weird lately. Shuuichi reveals his rising desire to leave the town with Kirie, saying that the town is infected with spirals.\n\nBut his father's obsession with the shape soon proves deadly, beginning a chain of horrific and unexplainable events that causes the residents of Kurouzu-cho to spiral into madness.",
    "cover_image_url": "https://ononougi.com/thumbs/Uzumaki/36e26e66-dfff-57d6-aed2-19d13d96e798.webp",
    "status": "Completed",
    "color": "#c1786e",
    "updated_at": "2025-05-23 22:14:31.449385+00",
    "created_at": "2025-05-23 22:09:43.694391+00",
    "mal_url": "https://myanimelist.net/manga/436/Uzumaki"
  },
  {
    "manga_id": 173,
    "title": "InuYasha",
    "descr": "Kagome Higurashi's ordinary life comes to an abrupt halt when a demon drags her deep into a well, transporting her five hundred years into the past. In this era, Kagome quickly learns two things: demons walk amongst humans and she has unknowingly brought a dangerous object from her world—a marble-sized sphere known as the Shikon Jewel. This unusual orb brings tremendous power to any demon who has it in their possession, and Kagome is an easy target for anyone determined enough to steal it.\n\nWhile in a fight with a demon, a hasty attempt to fend it off causes Kagome to accidentally shatter the jewel, sending countless pieces of it all over feudal Japan. She soon learns the grave consequences of her actions when she must work with the half-demon Inuyasha to collect all the pieces of the jewel before they fall into the wrong hands.",
    "cover_image_url": "https://ononougi.com/thumbs/InuYasha/c63c7c95-bcc9-5d22-8ef6-964527928009.webp",
    "status": "Completed",
    "color": "#d1a94c",
    "updated_at": "2025-06-15 23:35:24.426827+00",
    "created_at": "2025-06-15 21:43:05.242284+00",
    "mal_url": "https://myanimelist.net/manga/676/InuYasha"
  },
  {
    "manga_id": 29,
    "title": "3-gatsu no Lion",
    "descr": "Rei Kiriyama is an extraordinary shogi player. Among the few elites to have gone professional as a middle school student, he is considered a genius. But what lies behind his prodigious facade is a teenage boy who suffers immense pressure from both his family and from the high expectations from the shogi community. Rei moves out to live a more independent life away from his family, but his unorganized lifestyle and unsociable personality show no signs of improvement.\n\nHowever, in a twist of fate that will prove to be a turning point in his life, Rei encounters the Kawamoto sisters—the motherly Akari, the passionate Hinata, and the energetic Momo—who take great care of him. 3-gatsu no Lion tells the story of Rei as he reshapes his melancholic life and picks up the courage to begin facing the problems he evaded during his past.",
    "cover_image_url": "https://ononougi.com/thumbs/3-gatsu no Lion/ba159008-ca54-50d3-adbb-560296f19724.webp",
    "status": "OnGoing",
    "color": "#f6de9b",
    "updated_at": "2025-05-23 22:53:56.861803+00",
    "created_at": "2025-05-23 22:20:08.892456+00",
    "mal_url": "https://myanimelist.net/manga/1224/3-gatsu_no_Lion"
  },
  {
    "manga_id": 30,
    "title": "Fullmetal Alchemist",
    "descr": "Alchemists are knowledgeable and naturally talented individuals who can manipulate and modify matter due to their art. Yet despite the wide range of possibilities, alchemy is not as all-powerful as most would believe. Human transmutation is strictly forbidden, and whoever attempts it risks severe consequences. Even so, siblings Edward and Alphonse Elric decide to ignore this great taboo and bring their mother back to life. Unfortunately, not only do they fail in resurrecting her, they also pay an extremely high price for their arrogance: Edward loses his left leg and Alphonse his entire body. Furthermore, Edward also gives up his right arm in order to seal his brother's soul into a suit of armor.\n\nYears later, the young alchemists travel across the country looking for the Philosopher's Stone, in the hopes of recovering their old bodies with its power. However, their quest for the fated stone also leads them to unravel far darker secrets than they could ever imagine.",
    "cover_image_url": "https://ononougi.com/thumbs/Fullmetal Alchemist/de6ba8e2-78e3-595b-8125-fbc54e209b8f.webp",
    "status": "Completed",
    "color": "#9a362d",
    "updated_at": "2025-05-24 21:33:11.640156+00",
    "created_at": "2025-05-23 23:04:56.63314+00",
    "mal_url": "https://myanimelist.net/manga/25/Fullmetal_Alchemist"
  },
  {
    "manga_id": 101,
    "title": "Gunnm: Last Order",
    "descr": "After being killed in an explosion set by Desty Nova, Gally is brought back to life in the city of Tiphares by the resourceful yet devious scientist. She learns that the floating city is caught in a chaotic civil war over the public revelation of brain biochips, the Tipharean substitution to the organic human brain. To have any chance at stopping the bloodshed, Gally joins Nova’s newly-formed entourage, which includes his assistants Elf and Zwölf, the battle android Sechs, and the repair robot Deckman 100.\n\nTiphares and its conflict is just one small piece to an unknown star system that Gally has yet to discover. In hopes of finding more answers to her forgotten past, she and the other group members venture into the vastness of space, beginning an adventure that is set to alter the course of humanity.",
    "cover_image_url": "https://ononougi.com/thumbs/Gunnm Last Order/0ae72129-2405-5027-a73a-96af71a88f7e.webp",
    "status": "Completed",
    "color": "#b75f52",
    "updated_at": "2025-06-05 13:21:22.659076+00",
    "created_at": "2025-06-05 12:33:06.921115+00",
    "mal_url": "https://myanimelist.net/manga/770/Gunnm__Last_Order"
  },
  {
    "manga_id": 61,
    "title": "Hokuto no Ken",
    "descr": "The year is 199X. The Earth has been devastated by nuclear war. The seas have dried up and the land is cracked and desolate. Most living things on the planet have become extinct apart from the human race. In this new age violence rules as civilization is lost and the strong rule the weak in a world where food and water are the only thing with value. At this time a mysterious man named Kenshirou appears with his deadly martial art, the 2000 years old Hokuto Shinken. With his deadly style eliminating the evil is he the savior of the new era?",
    "cover_image_url": "https://ononougi.com/thumbs/Hokuto no Ken/a969304f-1caa-5804-a43f-09f4417f1f66.webp",
    "status": "Completed",
    "color": "#4F5660",
    "updated_at": "2025-05-29 13:47:04.754149+00",
    "created_at": "2025-05-29 11:24:37.940148+00",
    "mal_url": "https://myanimelist.net/manga/1149/Hokuto_no_Ken"
  },
  {
    "manga_id": 80,
    "title": "Dead Dead Demons Dededede Destruction",
    "descr": "When you look up at the sky, what do you see? A blue sky? Freedom? A hopeful future? The people of Tokyo see none of these. Instead, an ominous alien mothership looms overhead, engulfing the city skyscape.\n\nThree years ago, they came. The arrival of the \"Invaders\" sparked the greatest war humanity had ever faced—one that threatened to end the world. The Japanese government scrambled to fight the Invaders. Weapons were mass-produced, sparking controversy and pacifist movements.\n\nThat day, everything changed. And yet, nothing has changed. Kadode Koyama and Ouran Nakagawa live their final days like they always have: going to school, playing with friends, and doing what any carefree high school girl would do.\n\nAs they grow up, they come to learn what it truly means to be an adult in a world where adults seem to be demons who only deceive and destroy. They come to learn the real threat to humanity is not the Invaders, but humanity itself.",
    "cover_image_url": "https://ononougi.com/thumbs/Dead Dead Demons Dededede Destruction/fc810966-045b-503c-a2ef-8ddd444afd82.webp",
    "status": "Completed",
    "color": "#5cc2ed",
    "updated_at": "2025-06-03 00:39:18.478892+00",
    "created_at": "2025-06-03 00:13:26.363951+00",
    "mal_url": "https://myanimelist.net/manga/70801/Dead_Dead_Demons_Dededede_Destruction"
  },
  {
    "manga_id": 102,
    "title": "Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen",
    "descr": "Considered a genius due to having the highest grades in the country, Miyuki Shirogane leads the prestigious Shuchiin Academy's student council as its president, working alongside the beautiful and wealthy vice president Kaguya Shinomiya. The two are often regarded as the perfect couple by students despite them not being in any sort of romantic relationship.\n\nHowever, the truth is that after spending so much time together, the two have developed feelings for one another; unfortunately, neither is willing to confess, as doing so would be a sign of weakness. With their pride as elite students on the line, Miyuki and Kaguya embark on a quest to do whatever is necessary to get a confession out of the other. Through their daily antics, the battle of love begins!",
    "cover_image_url": "https://ononougi.com/thumbs/Kaguya-sama wa Kokurasetai Tensai-tachi no Renai Zunousen/ca3f17b8-4c2e-5f62-86be-c4b8cc0c4270.webp",
    "status": "Completed",
    "color": "#bc161d",
    "updated_at": "2025-06-05 13:43:34.462499+00",
    "created_at": "2025-06-05 12:48:28.675655+00",
    "mal_url": "https://myanimelist.net/manga/90125/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen"
  },
  {
    "manga_id": 31,
    "title": "Koukaku Kidoutai: The Ghost in the Shell",
    "descr": "The year is 2029. The world has endured four world wars and ushered in a new age of technological advancement that has largely transformed society as humanity knows it. Cybernetic enhancements, robotic AIs, and cyborgs have now become the norm in a world where humans are more machine than man. However, with this modern change, crime started evolving as well: hackers, corrupt officials, and other opportunists have found ways to sneak into innovative systems for their own personal agendas.\n\nIn Japan, where such crimes run rampant, the government establishes Section 9—a clandestine team of highly trained operatives—to counter these threats. Major Motoko Kusanagi, a woman of impenetrable caliber and bravado, leads Section 9 on its mission to tackle cyberterrorism and ensure that the nation's stability does not falter in the pace of the rapidly progressing future.",
    "cover_image_url": "https://ononougi.com/thumbs/Koukaku Kidoutai The Ghost in the Shell/54bedcbe-5982-59ca-8319-1b3de2bb2994.webp",
    "status": "Completed",
    "color": "#278eb5",
    "updated_at": "2025-05-29 14:07:04.288494+00",
    "created_at": "2025-05-23 23:39:57.396779+00",
    "mal_url": "https://myanimelist.net/manga/123157/Koukaku_Kidoutai__Ghost_in_the_Shell_Comic_Tribute"
  },
  {
    "manga_id": 81,
    "title": "Mob Psycho 100",
    "descr": "Shigeo \"Mob\" Kageyama is an eighth-grade student blessed with extraordinary psychic powers. However, Mob decides to suppress his abilities in public due to its destructive and conspicuous nature. To keep his psychic powers honed, he works under Arataka Reigen—a self-proclaimed esper looking to make use of Mob's skills.\n\nAlongside Reigen, Mob spends his days exorcising evil spirits at Reigen's behest. With the simple wish to impress his childhood friend Tsubomi Takane, Mob works toward making himself more desirable. But troubles keep on bombarding his daily life, slowly breaking his shackled feelings. With his repressed emotions welling up, there's no telling what will happen once he reaches his limit.",
    "cover_image_url": "https://ononougi.com/thumbs/Mob Psycho 100/65bb8539-03e7-56c7-b59c-f37c90497d6c.webp",
    "status": "Completed",
    "color": "#df1b2a",
    "updated_at": "2025-06-03 22:41:27.347904+00",
    "created_at": "2025-06-03 21:33:20.123839+00",
    "mal_url": "https://myanimelist.net/manga/60783/Mob_Psycho_100"
  },
  {
    "manga_id": 32,
    "title": "Haikyuu!!",
    "descr": "After watching the largely unknown Karasuno High School overwhelmingly win a volleyball practice match, soon-to-be first-year high school student Shouyou Hinata aspires to join their team as the ace. Unfortunately, his short stature and lack of experience in playing any sort of official game earns him the ire of Karasuno's current members, including the team's famous setter Tobio Kageyama. Determined to prove that he has what it takes—and with a strong desire to show Kageyama he is wrong—Hinata begins to train and hone his skills in order to soar above them all.",
    "cover_image_url": "https://ononougi.com/thumbs/Haikyuu!!/b4333280-9431-55c8-8f96-53fce57ac976.webp",
    "status": "OnGoing",
    "color": "#dc8346",
    "updated_at": "2025-05-24 03:16:57.701533+00",
    "created_at": "2025-05-23 23:49:12.361236+00",
    "mal_url": "https://myanimelist.net/manga/30987/Haikyuu"
  },
  {
    "manga_id": 189,
    "title": "Baccano!",
    "descr": "Aboard the Advenna Avis in 1711, a group of alchemists summon a demon in the hopes of gaining eternal life. The demon gives them an elixir of immortality and the method of ending their existence by \"devouring\" one another. Soon after, one among them begins to devour his companions. Realizing the danger posed by staying together, they scatter across the globe.\n\nCenturies later in 1930's America, a certain federal investigator tries his best to combat the rise of organized crime during Prohibition, send a particularly infuriating terrorist to Alcatraz, and catch an outrageous thief duo. Meanwhile, the transcontinental train, the Flying Pussyfoot, begins its trail of blood across the country.\n\nIn 2002, a small group of the original Advenna Avis alchemists are on a journey to find the rest of their fellow immortals. However, there is one companion they did not expect to meet again.\n\nSeemingly unrelated events, from a sleepy Italian city in the early 1700's to a modern luxury cruise ship traveling across the Pacific, reveal themselves to be far more connected than anyone could imagine...",
    "cover_image_url": "https://ononougi.com/thumbs/Baccano!/55bfc56c-8051-5b6d-97f2-4bb9c97efa0a.webp",
    "status": "Completed",
    "color": "#901f25",
    "updated_at": "2025-06-18 23:26:31.203908+00",
    "created_at": "2025-06-18 23:23:25.352404+00",
    "mal_url": "https://myanimelist.net/manga/92203/Baccano"
  },
  {
    "manga_id": 62,
    "title": "Houseki no Kuni",
    "descr": "Long ago, Earth was struck by six meteorites, creating six moons and leaving a lone island in their wake. Those who could not make it to the island sank to the bottom of the ocean, where, over time, they slowly turned to crystal. As countless millennia passed, 28 of these crystallized lifeforms, known as the Lustrous, rose from the depths and resided on the island. Led by the wise Kongou-sensei, they must defend themselves against the seemingly infinite number of Lunarians, inhabitants of the moons who seek to harvest their valuable bodies for crafting weapons and jewelry.\n\nHouseki no Kuni centers around Phosphophyllite, a young gem about to turn three hundred years old. Clumsy, extremely fragile, and having no visible talent, they are one of the weakest gems around, unable to help in the fight against the Lunarians in any meaningful way. But as the battle with the otherworldly invaders rages on, they soon learn that power comes at a cost that no one should have to pay.",
    "cover_image_url": "https://ononougi.com/thumbs/Houseki no Kuni/066bd6e9-286e-51e4-a7aa-d92071a3cdea.webp",
    "status": "Completed",
    "color": "#2bab90",
    "updated_at": "2025-05-29 21:31:42.95325+00",
    "created_at": "2025-05-29 15:09:27.134505+00",
    "mal_url": "https://myanimelist.net/manga/44489/Houseki_no_Kuni"
  },
  {
    "manga_id": 160,
    "title": "Akame ga Kill! Zero",
    "descr": "They believed that every time they took a life, they brought happiness to another...\n\nBefore becoming Night Raid's deadliest ally, Akame was a young girl bought by the Empire and raised as an assassin whose sole purpose was to slaughter everything in her path. Because that's what makes people happy... right?",
    "cover_image_url": "https://ononougi.com/thumbs/Akame ga Kill! Zero/e3a01d40-6357-51b3-9268-c0d21139f1a3.webp",
    "status": "Completed",
    "color": "#bb181b",
    "updated_at": "2025-06-15 12:51:24.329835+00",
    "created_at": "2025-06-15 12:39:10.944777+00",
    "mal_url": "https://myanimelist.net/manga/56165/Akame_ga_Kill_Zero"
  },
  {
    "manga_id": 48,
    "title": "Beastars",
    "descr": "In a world populated by anthropomorphic animals, there exists a bias: carnivores are just mindless predators in the eyes of many herbivores. However, when an alpaca named Tem is murdered within the walls of Cherryton High School, the fear toward carnivores skyrockets to an all-time high.\n\nLegoshi, a student at this school, is a gray wolf who is quite awkward despite his fearsome appearance. When turmoil affects his school life, he is forced to confront the divide between herbivores and carnivores, as well as his own place in this society. This is further complicated by his supposedly romantic feelings toward a herbivore, which might not be what they seem.\n\nBeastars details Legoshi's struggles against his inner demons while living in a society that is unforgiving toward his kind.",
    "cover_image_url": "https://ononougi.com/thumbs/Beastars/033a6681-82ce-5da0-bd62-1858d6099f39.webp",
    "status": "Completed",
    "color": "#5E727A",
    "updated_at": "2025-05-27 00:58:21.941195+00",
    "created_at": "2025-05-26 23:58:49.839057+00",
    "mal_url": "https://myanimelist.net/manga/103701/Beastars"
  },
  {
    "manga_id": 154,
    "title": "Nisekoi",
    "descr": "When Raku Ichijou was young, he made a heartfelt promise to his childhood friend that if they were to meet again, they would marry each other. Ten years have passed since that fateful day, leaving Raku's memory of her faded. But he still holds a relic of their relationship together—a locked pendant, which his childhood friend holds the key to. He hopes to reunite with her one day, despite not remembering what she looks like.\n\nNow a first-year student at Bonyari High School, Raku attempts to live a normal life, dreaming of becoming a public servant and marrying his crush Kosaki Onodera. However, this isn't as easy as it seems, as he is the unwilling heir to a large yakuza family, and Raku can't escape from his duties when the American Bee Hive gang wages war on his family's turf. In order to forge peace between the two feuding families, Raku is forced into a fake romantic relationship with Chitoge Kirisaki, the beautiful daughter of the Bee Hive's leader. The two quickly come to hate each other, but have to learn to live together and pretend to be deeply in love in order to keep their families at bay.\n\nHowever, Raku's quest for the key to his pendant isn't becoming easier as more girls—who were all involved with his pendant in some way—enter his life. Join Raku as he juggles his false relationship, maintains the balance between warring families, and unravels the identity of the girl who will unlock his heart.",
    "cover_image_url": "https://ononougi.com/thumbs/Nisekoi/9b5ce315-c34c-5bf4-8832-b42be4a4faf5.webp",
    "status": "Completed",
    "color": "#19a1cf",
    "updated_at": "2025-06-14 22:29:39.143303+00",
    "created_at": "2025-06-14 21:51:43.474528+00",
    "mal_url": "https://myanimelist.net/manga/31499/Nisekoi"
  },
  {
    "manga_id": 260,
    "title": "Platinum End",
    "descr": "After the death of his parents, a young Mirai Kakehashi is left in the care of his abusive relatives. Since then, he has become gloomy and depressed, leading him to attempt suicide on the evening of his middle school graduation. Mirai, however, is saved by a pure white girl named Nasse who introduces herself as a guardian angel wishing to give him happiness—by granting him supernatural powers and a chance to become the new God.\n\nIn order to earn the position, he must defeat 12 other \"God Candidates\" within 999 days. Soon, Mirai begins a struggle to survive as a terrifying battle royale erupts between himself and the candidates looking to obtain the most power in the world.",
    "cover_image_url": "https://ononougi.com/thumbs/Platinum End/710f296c-dfc1-5ecc-9051-00ece0417d26.webp",
    "status": "Completed",
    "color": "#cb455a",
    "updated_at": "2025-07-01 22:14:24.194355+00",
    "created_at": "2025-07-01 21:47:04.402337+00",
    "mal_url": "https://myanimelist.net/manga/93180/Platinum_End"
  },
  {
    "manga_id": 33,
    "title": "Blame!",
    "descr": "In an enormous steel labyrinth riddled with horrifying creatures, humanity is forced to isolate itself in small enclaves while living in constant fear of its annihilation. In this dystopia, only a strange young man known as Killy is brave enough to traverse its unforgiving territories. \n\nPossessing superhuman strength and a rare Graviton Beam Emitter, Killy fights off bloodthirsty beasts and other fiendish forces in his desperate search for a human with the Net Terminal Gene—genetic information that holds the potential to restore the corrupt world. \n\nThe dark world of Blame! follows Killy as he meets new people, sheds more blood, and draws closer to finding the Net Terminal Gene. Through these exploits, the true nature of the world is slowly pieced together.",
    "cover_image_url": "https://ononougi.com/thumbs/Blame!/95a734bd-bfd9-57fb-9861-aa94ed2bbf67.webp",
    "status": "Completed",
    "color": "#d07141",
    "updated_at": "2025-05-24 00:49:08.941092+00",
    "created_at": "2025-05-24 00:35:36.584654+00",
    "mal_url": "https://myanimelist.net/manga/149/Blame"
  },
  {
    "manga_id": 71,
    "title": "Ajin - Demi-Human",
    "descr": "Seventeen years ago, mysterious immortal soldiers known as divine warriors appeared on the battlefields of Africa. These life forms later became known as Ajin, or demi-humans, and were considered to be one of the greatest discoveries of mankind. The government declared their existence to be compatible with humans; however, it is rumored that they instead offer bounties for captured Ajin to secretly perform inhumane experiments on these rare beings.\n\nKei Nagai, an apathetic high school student, is studying to become a doctor and only wishes to live a normal life. However, this simple dream is shattered after he suddenly gets into a deadly traffic accident. Revived at the scene, he is immediately labeled as an Ajin by bounty-hungry witnesses. Unable to understand his immortality or prove his innocence, he starts to live his life on the run and fights for survival. He barely escapes the government's reach when a group of anarchistic Ajin contacts Kei, asking him to join their forces to retaliate against the government. But who is Kei's real enemy, and which side will he take when it comes down to humans versus Ajin?",
    "cover_image_url": "https://ononougi.com/thumbs/Ajin - Demi-Human/37bb4db2-1e1b-5193-bf50-75d558efd39d.webp",
    "status": "Completed",
    "color": "#024956",
    "updated_at": "2025-06-02 19:06:07.942972+00",
    "created_at": "2025-06-02 18:34:57.523037+00",
    "mal_url": "https://myanimelist.net/manga/49865/Ajin"
  },
  {
    "manga_id": 64,
    "title": "xxxHOLiC",
    "descr": "Living alone after his parents passed away, Kimihiro Watanuki is a high school student who can see otherworldly creatures that are attracted to him. His days are plagued by these nuisances, and he wishes to rid himself of this inconvenience. One fateful day, as Kimihiro is being chased by a horde of spirits, his feet bring him into a mysterious store to seek shelter. Here he meets Yuuko Ichihara, the mistress of this supposed store, who claims to be able to grant wishes. Yuuko offers to grant Kimihiro's, as long as he pays an appropriate price.\n\nThus begins Kimihiro's time working in her store to earn the payment necessary for his wish. In Yuuko's employ, he must become further involved with spirits and the supernatural before he can leave that world behind. How will he fare in the inexplicable encounters that await him?",
    "cover_image_url": "https://ononougi.com/thumbs/xxxHOLiC/9045107b-b27e-5aa8-897b-4f33b7d18309.webp",
    "status": "Completed",
    "color": "#dd212b",
    "updated_at": "2025-05-30 01:05:43.396765+00",
    "created_at": "2025-05-30 00:40:13.273088+00",
    "mal_url": "https://myanimelist.net/manga/10/xxxHOLiC"
  },
  {
    "manga_id": 127,
    "title": "Yuru Camp",
    "descr": "\"Setting up a tent, starting a fire, and eating noodles with Mt. Fuji in view...Rin and Nadeshiko absolutely love to camp! Enjoy their zest for travel and maybe even pick up a tip or two about roughing it in the great outdoors. You might just want to go camping yourself!",
    "cover_image_url": "https://ononougi.com/thumbs/Yuru Camp/ffc3a675-257f-51b4-97f8-ddec9df395f4.webp",
    "status": "OnGoing",
    "color": "#B0BF94",
    "updated_at": "2025-06-05 22:41:19.755469+00",
    "created_at": "2025-06-05 22:25:01.266359+00",
    "mal_url": "https://myanimelist.net/manga/94376/Yuru_Camp△"
  },
  {
    "manga_id": 73,
    "title": "Bakemonogatari",
    "descr": "Koyomi Araragi is no stranger to the abnormal. During the spring break of his third year in high school, a fateful encounter with vampire Kiss-Shot Acerola-Orion Heart-Under-Blade turns him into a vampire himself. Thrust into the world of oddities, Araragi finds himself catching classmate Hitagi Senjougahara when she falls down the school stairs one day—but something is amiss. After being confronted by the girl in question, Araragi learns that her weight was stolen by a mythical crab. In spite of Senjougahara's blunt threats, he manages to convince her to let him help. In need of a solution to an abnormal problem, the two visit the mysterious Meme Oshino, a wanderer who saved Araragi from his vampirism.\n\nBakemonogatari is a tale about the monsters that reside within everyone, but just how deep do they dwell in the people Araragi meets?",
    "cover_image_url": "https://ononougi.com/thumbs/Bakemonogatari/0bf879b7-9931-5778-a3df-a66813133add.webp",
    "status": "Completed",
    "color": "#be294f",
    "updated_at": "2025-06-02 20:17:11.014306+00",
    "created_at": "2025-06-02 19:33:44.230964+00",
    "mal_url": "https://myanimelist.net/manga/113010/Bakemonogatari"
  },
  {
    "manga_id": 91,
    "title": "Claymore",
    "descr": "It is the Middle Ages, and the remnants of mankind are plagued by paranoia and death. Spoken in fearful whispers, the word \"Yoma\" cuts a clear image into the minds of all: monstrous beings with an insatiable hunger for human flesh. But fear of their gruesome appetite is dwarfed by that of their ability to shapeshift and steal the memories of their last meal. Forever vulnerable to attack, humans live in unease, even among family.\n\nThere are few means to kill a Yoma. The Organization, informally known as \"Claymore,\" is humanity's only line of defense, dispatching half-human, half-Yoma female warriors to purify villages of Yoma. A lonely and dangerous existence, death for these warriors comes with each new assignment. What time is found between trying battles and long, arduous travels is spent in ever-intensifying struggle to resist their Yoma blood and maintain their humanity. Villagers, knowing of this, pay for their security reluctantly and have only loathsome regard for their protectors.\n\nClaymore follows the stoic and low-ranking member Clare in her daunting trek as she searches for personal vengeance. Along the way, she encounters many unexpected things about the world, from the camaraderie and hope held fast by her sisters-in-arms to the sinister truth behind the Claymore Organization.",
    "cover_image_url": "https://ononougi.com/thumbs/Claymore/0141c3ec-68ba-5e97-9f26-9804e63a7201.webp",
    "status": "Completed",
    "color": "#ed8f71",
    "updated_at": "2025-06-05 00:01:31.899068+00",
    "created_at": "2025-06-04 23:20:03.257849+00",
    "mal_url": "https://myanimelist.net/manga/583/Claymore"
  },
  {
    "manga_id": 107,
    "title": "Wondance",
    "descr": "Kaboku Kotani is starting high school, and he plans to do what he's always done: go along with his friends, keep quiet, and not draw too much attention to himself. After all, it's hard enough to get by with a stutter like his—why make things worse by standing out from the crowd? But then he sees another first-year, Hikari Wanda, dancing like no one is watching—or like she doesn't care who sees her. It makes Kaboku wonder: Could he reach that same freedom? To find his way to Wanda, he does something he never thought he could: He joins the dance club. After all, every routine begins with a single step, right? Join Kaboku and Wanda as they freestyle their way to life and love!",
    "cover_image_url": "https://ononougi.com/thumbs/Wondance/ee138848-2d4e-5508-bf71-e79f7d5247a7.webp",
    "status": "OnGoing",
    "color": "#b40653",
    "updated_at": "2025-06-05 14:32:00.845364+00",
    "created_at": "2025-06-05 14:09:01.949697+00",
    "mal_url": "https://myanimelist.net/manga/127120/Wondance"
  },
  {
    "manga_id": 74,
    "title": "Blue Period",
    "descr": "Second-year high school student Yatora Yaguchi is bored with his normal life. He studies well and plays around with his friends, but in truth, he does not enjoy either of those activities. Bound by norms, he secretly envies those who do things differently.\n\nThat is until he discovers the joy of drawing. When he sees a painting made by a member of the Art Club, Yatora becomes fascinated with the colors used in it. Later, in an art exercise, he tries to convey his language without words but instead through painting. After that experience, Yatora finds himself so invested in art that he decides that it is what he wants to do for a living. But there stand multiple obstacles in his way: his parents who are hesitant over his unique choices, his more experienced peers, and the study of a subject much deeper than he initially expected.",
    "cover_image_url": "https://ononougi.com/thumbs/Blue Period/9690ce7a-c214-5792-99ad-c33a1f518bea.webp",
    "status": "OnGoing",
    "color": "#21a1d5",
    "updated_at": "2025-06-02 20:52:14.061296+00",
    "created_at": "2025-06-02 20:18:03.456889+00",
    "mal_url": "https://myanimelist.net/manga/107931/Blue_Period"
  },
  {
    "manga_id": 162,
    "title": "Innocent",
    "descr": "In the 18th century, seeking \"freedom and equality,\" the event that became the starting point of modern French society, the French Revolution, began. There was one more protagonist that lived within the darkness, Charles-Henri Sanson. He was the fourth generation family head of the Sanson family, and the executioner of Paris. This is the story of him nobly facing his harsh fate...",
    "cover_image_url": "https://ononougi.com/thumbs/Innocent/76d0dfa5-5435-5a01-9b44-f512822d8c63.webp",
    "status": "Completed",
    "color": "#e6e6e6",
    "updated_at": "2025-06-15 15:00:10.559983+00",
    "created_at": "2025-06-15 14:32:53.763756+00",
    "mal_url": "https://myanimelist.net/manga/22741/Innocent"
  },
  {
    "manga_id": 171,
    "title": "Nichijou",
    "descr": "Daily lives of high school students may seem a commonplace concept, but that certainly does not apply to the trio at Tokisadame High. For Yuuko Aioi and her two eccentric friends, every day is a unique experience. From stumbling across a wrestling match between the principal and a deer to indulging in a chopstick battle over a sausage—the excitement never ends.\n\nOne day, their lives take a turn for the bizarre when they encounter an insecure robot maid, her young excitable creator, and their down-to-earth talking cat. To the people in the world of Nichijou, daily life continues to be an endless roller coaster!",
    "cover_image_url": "https://ononougi.com/thumbs/Nichijou/797b9d0f-00c9-559d-9344-9dead52a0b9b.webp",
    "status": "OnGoing",
    "color": "#c5a889",
    "updated_at": "2025-06-15 20:45:28.311796+00",
    "created_at": "2025-06-15 20:21:46.264678+00",
    "mal_url": "https://myanimelist.net/manga/3082/Nichijou"
  },
  {
    "manga_id": 75,
    "title": "Kimi no Na wa",
    "descr": "Mitsuha Miyamizu is a high school girl living in the countryside town of Itomori. She yearns for a life in Tokyo, as she is sick of living in the countryside. At the same time, Taki Tachibana, a high school student, lives in Tokyo and has a great interest in architecture, aiming to become an urban planner in the near future.\n\nOne day, Mitsuha dreams of herself as a boy living a life in the dense capital, while Taki dreams of living as a girl in the rural town of Itomori. As time passes by, the two discover that these are not just dreams, but that they actually swap bodies upon falling asleep! Kimi no Na wa. revolves around Mitsuha and Taki as they experience the supernatural. With both of them working together to deal with the strange phenomenon, how will this impact their everyday life?",
    "cover_image_url": "https://ononougi.com/thumbs/Kimi no Na wa/28af928a-2678-51ba-a463-f4ee3a665be9.jpg",
    "status": "Completed",
    "color": "#7296c0",
    "updated_at": "2025-06-02 20:39:22.540742+00",
    "created_at": "2025-06-02 20:37:04.809351+00",
    "mal_url": "https://myanimelist.net/manga/77959/Kimi_no_Na_wa"
  },
  {
    "manga_id": 147,
    "title": "Kobayashi-san Chi no Maid Dragon: Elma no OL Nikki",
    "descr": "Aligned with the Harmony Faction, Elma cultivates prosperity and maintains peace between humans, even once being worshipped as a goddess for her benevolent actions. However, the steadfast dragon has now become an office worker to observe Tooru in hopes of eventually bringing her back to the dragon world.\n\nDespite her commitment to accomplishing such an ambitious goal, the vast array of culinary selections captures Elma's heart and appetite, proving an effective distraction. Even so, Elma strives to find a balance between her challenging duties and gluttonous cravings as she begins a new chapter in human society.",
    "cover_image_url": "https://ononougi.com/thumbs/Kobayashi-san Chi no Maid Dragon Elma no OL Nikki/f4aedc27-9a8d-5286-90d9-c794ece38c2a.webp",
    "status": "OnGoing",
    "color": "#2aaad8",
    "updated_at": "2025-06-14 15:13:43.215947+00",
    "created_at": "2025-06-14 14:59:32.560212+00",
    "mal_url": "https://myanimelist.net/manga/109153/Kobayashi-san_Chi_no_Maid_Dragon__Elma_no_OL_Nikki"
  },
  {
    "manga_id": 231,
    "title": "Kimetsu no Yaiba Gaiden",
    "descr": "[1-2] Kimetsu no Yaiba: Tomioka Giyuu Gaiden\nShortly after his encounter with Tanjirou Kamado, the Water Hashira Giyuu Tomioka embarks on a mission to investigate several demon-related deaths that have occurred in the Snowy Mountains. The attacks are supposedly being instigated by a bear deprived of its den, but the Demon Slayer Corps believe otherwise. Upon arriving, he joins forces with Insect Hashira Shinobu Kochou. Throughout the duration of the mission, Giyuu discovers compassion and learns about the resilience of family.\n\n[3-4] Kimetsu no Yaiba: Rengoku Kyoujurou Gaiden\nKyojuro also receives his newest assignment and hopes completing it will prove he's worthy of the title Flame Hashira, which his father abandoned. An explosive battle unfolds as Kyojuro takes on a demon of the Twelve Kizuki who holds a grudge against Kyojuro's father\n\n[4.1] Kimetsu no Aima!\nA series of single-page, four-panel gag manga that released after each episode of the Kimetsu no Yaiba anime and involved the events of that week's episode. ",
    "cover_image_url": "https://ononougi.com/thumbs/Kimetsu no Yaiba Gaiden/228df590-c7be-525a-a80e-0417d2e7eaf2.webp",
    "status": "Completed",
    "color": "#923a35",
    "updated_at": "2025-07-03 12:21:20.377903+00",
    "created_at": "2025-06-21 20:21:09.585723+00",
    "mal_url": "https://myanimelist.net/manga/131706/Kimetsu_no_Yaiba_Gaiden"
  },
  {
    "manga_id": 190,
    "title": "Fire Punch",
    "descr": "In a world ravaged by ice and snow, civilization is on the brink of collapse thanks to the elusive Ice Witch. Fighting against the cold has brought out the worst in humanity, leading to cults, violence, and the persecution of the Blessed—those born with supernatural powers.\n\nAgni and Luna—blessed orphans with regenerative powers—are making the best of their situation within a small society of elders; their affection for each other serves as a distraction from the uninhabitable climate. Nevertheless, what little serenity they have is stolen away when army commander Doma passes through and incinerates the village they are seeking refuge in—Agni's beloved sister included. Doma's flames do not extinguish until they have reduced their target to ash, and due to Agni's remarkable regeneration, he remains ablaze and in constant, excruciating pain.\n\nAfter nearly a decade of enduring the pain, Agni has conditioned himself to tolerate Doma's flames. However, his burning vengeance is as fierce as it was on the day Luna was taken from him. As Agni traverses a frozen wasteland, he vows to avenge his sister and kill Doma.",
    "cover_image_url": "https://ononougi.com/thumbs/Fire Punch/d0041273-a4cd-5f41-8c25-0d6a677adf0f.webp",
    "status": "Completed",
    "color": "#eb6f2d",
    "updated_at": "2025-06-19 00:47:20.897061+00",
    "created_at": "2025-06-19 00:31:02.262723+00",
    "mal_url": "https://myanimelist.net/manga/98270/Fire_Punch"
  },
  {
    "manga_id": 216,
    "title": "Megami no Café Terrace",
    "descr": "When Hayato's grandmother passed, he planned to sell her rundown café on the shore—not realizing that it was also home to five young women who call themselves her family?! Their desperation to keep the café open convinces Hayato to give it a shot...but even their best intentions might not be enough to make it work! And can he even work with these five unruly women? No matter what, he's got his work cut out for him!",
    "cover_image_url": "https://ononougi.com/thumbs/Megami no Café Terrace/d598bc1c-2134-54ab-87b3-f72a7ef1ea46.webp",
    "status": "OnGoing",
    "color": "#25568d",
    "updated_at": "2025-06-20 17:09:05.493203+00",
    "created_at": "2025-06-20 12:27:36.880861+00",
    "mal_url": "https://myanimelist.net/manga/32545/Megane_no_Megami"
  },
  {
    "manga_id": 155,
    "title": "5-toubun no Hanayome - Full-Color Version",
    "descr": "Considered a genius, high school student Fuutarou Uesugi excels at studying and obtains a perfect score on every test. Due to his intense focus in that regard, he is a reclusive person with no friends. Additionally, he lives in a tight financial state as a result of family debts.\n\nFuutarou's mundane lifestyle is interrupted when Itsuki Nakano, a new transfer student, contests him for his usual lunch seat. After a short altercation, Fuutarou emerges victorious by insulting Itsuki's eating habits, which angers her enough to leave. However, when Fuutarou learns that he has been offered the private tutor position of a wealthy family's academically hopeless daughters, he immediately regrets his prior encounter. It turns out that the beneficiaries of his tutoring are none other than Itsuki and her four identical siblings: the shy Miku, the cheerful Yotsuba, the devious Nino, and the mature Ichika!\n\nTeaching these quintuplets may prove more difficult for Fuutarou than he initially expected, as the last thing they want to do is seriously study. Now, Fuutarou must face the various challenges of tutoring five beautiful yet eccentric girls.",
    "cover_image_url": "https://ononougi.com/thumbs/5-toubun no Hanayome - Full-Color Version/0a303cb3-672d-5867-910a-0fb3be3c4b86.webp",
    "status": "Completed",
    "color": "#d71f2b",
    "updated_at": "2025-06-15 00:45:18.118687+00",
    "created_at": "2025-06-15 00:26:01.666398+00",
    "mal_url": "https://myanimelist.net/manga/103851/5-toubun_no_Hanayome"
  },
  {
    "manga_id": 87,
    "title": "Youkoso Jitsuryoku Shijou Shugi no Kyoushitsu e",
    "descr": "From the outside, attending the Tokyo Metropolitan Advanced Nurturing High School seems like a dream come true. Its students are given remarkable freedom, and it boasts a placement rate of almost one hundred percent. Tokyo Metropolitan can get students their places in the elite jobs and universities of their dreams—if they can win, barter, or save enough points to work their way up the ranks! Kiyotaka Ayanokouji has landed at the bottom of this cutthroat academy in the scorned Class D, where he meets Suzune Horikita, a girl who's determined to rise up the ladder to Class A. Can they beat the system in a school full of ruthless competition?",
    "cover_image_url": "https://ononougi.com/thumbs/Youkoso Jitsuryoku Shijou Shugi no Kyoushitsu e/01763ce8-c97e-53cc-9011-f11963485291.webp",
    "status": "OnGoing",
    "color": "#e30976",
    "updated_at": "2025-06-04 21:47:56.732414+00",
    "created_at": "2025-06-04 21:30:08.688365+00",
    "mal_url": "https://myanimelist.net/manga/89357/Youkoso_Jitsuryoku_Shijou_Shugi_no_Kyoushitsu_e"
  },
  {
    "manga_id": 191,
    "title": "Gigant",
    "descr": "Rei Yokoyamada, a high schooler whose father works for a film production company, is inspired to create his own short film with his friends. One day, while out to find actors, he spots tabloid-like notices that the adult film star Papico lives in his area. When he takes them down to protect her, he runs into the woman herself. Little does he know that Papico is about to get dragged into a strange, supernatural happening...where she grows to the size of a giant!",
    "cover_image_url": "https://ononougi.com/thumbs/Gigant/e92f9c44-9564-545d-be23-8c80c758802d.webp",
    "status": "Completed",
    "color": "#c11d21",
    "updated_at": "2025-06-19 00:57:06.390625+00",
    "created_at": "2025-06-19 00:35:57.797156+00",
    "mal_url": "https://myanimelist.net/manga/110727/Gigant"
  },
  {
    "manga_id": 192,
    "title": "Zom 100: Zombie ni Naru made ni Shitai 100 no Koto",
    "descr": "In a trash-filled apartment, 24-year-old Akira Tendou watches a zombie movie with lifeless, envious eyes. After spending three hard years at an exploitative corporation in Japan, his spirit is broken. He can't even muster the courage to confess his feelings to his beautiful co-worker Ohtori. Then one morning, he stumbles upon his landlord eating lunch—which happens to be another tenant! The whole city's swarming with zombies, and even though he's running for his life, Akira has never felt more alive!",
    "cover_image_url": "https://ononougi.com/thumbs/Zom 100 Zombie ni Naru made ni Shitai 100 no Koto/3a6cb4ac-d93a-5612-9ca4-ecd07c6b30ea.webp",
    "status": "OnGoing",
    "color": "#eb519e",
    "updated_at": "2025-06-19 01:32:38.192058+00",
    "created_at": "2025-06-19 00:49:49.195826+00",
    "mal_url": "https://myanimelist.net/manga/122392/Zom_100__Zombie_ni_Naru_made_ni_Shitai_100_no_Koto"
  },
  {
    "manga_id": 163,
    "title": "Sidonia no Kishi",
    "descr": "A thousand years into the future, Earth has been destroyed by powerful aliens known as Gauna. Although mankind has fled into space, the giant spaceships they now call home are still constantly being targeted by the strange creatures. Piloting mobile weapon units called \"Gardes,\" humanity is able to take a stand against their adversaries by destroying their cores, preventing the monsters from regenerating their protective shell of placenta.\n\nWithin the vessel Sidonia, a boy named Nagate Tanikaze surfaces from its depths for the very first time in his life. With an incredible amount of time clocked into pilot simulators during his isolation deep within the ship, he quickly proves to be an indispensable asset to humanity's defense force. With the opportunity to pilot the legendary Garde Tsugumori, he fights to protect Sidonia from a grim demise.",
    "cover_image_url": "https://ononougi.com/thumbs/Sidonia no Kishi/25389087-7495-5a58-b6a2-9ea24b8223cb.webp",
    "status": "Completed",
    "color": "#a12423",
    "updated_at": "2025-06-15 15:47:13.584507+00",
    "created_at": "2025-06-15 15:09:09.652001+00",
    "mal_url": "https://myanimelist.net/manga/13723/Sidonia_no_Kishi"
  },
  {
    "manga_id": 36,
    "title": "5-toubun no Hanayome",
    "descr": "Considered a genius, high school student Fuutarou Uesugi excels at studying and obtains a perfect score on every test. Due to his intense focus in that regard, he is a reclusive person with no friends. Additionally, he lives in a tight financial state as a result of family debts.\n\nFuutarou's mundane lifestyle is interrupted when Itsuki Nakano, a new transfer student, contests him for his usual lunch seat. After a short altercation, Fuutarou emerges victorious by insulting Itsuki's eating habits, which angers her enough to leave. However, when Fuutarou learns that he has been offered the private tutor position of a wealthy family's academically hopeless daughters, he immediately regrets his prior encounter. It turns out that the beneficiaries of his tutoring are none other than Itsuki and her four identical siblings: the shy Miku, the cheerful Yotsuba, the devious Nino, and the mature Ichika!\n\nTeaching these quintuplets may prove more difficult for Fuutarou than he initially expected, as the last thing they want to do is seriously study. Now, Fuutarou must face the various challenges of tutoring five beautiful yet eccentric girls.",
    "cover_image_url": "https://ononougi.com/thumbs/The Quintessential Quintuplets/89e72c23-93b6-525d-be91-c89d83baea17.webp",
    "status": "Completed",
    "color": "#e14c49",
    "updated_at": "2025-05-24 18:03:19.626242+00",
    "created_at": "2025-05-24 17:42:00.840723+00",
    "mal_url": "https://myanimelist.net/manga/103851/5-toubun_no_Hanayome"
  },
  {
    "manga_id": 148,
    "title": "Koe no Katachi",
    "descr": "Shouya Ishida, a mischievous elementary school student, finds himself troubled by deaf transfer student Shouko Nishimiya. Despite her genuine attempts to befriend her new classmates, Shouko only proves herself to be an annoyance for Shouya and his friends, provoking them to ridicule her at any possible chance. Soon enough, their taunts turn into constant assault—yet the teachers heartlessly remain apathetic to the situation.\n\nShouya's misdeeds are finally stopped when Shouko transfers to another school. Denying their involvement, the entire class puts the blame on Shouya. As the new victim of bullying, Shouya gradually becomes meek and reclusive, being treated with contempt and disregard for years to come.\n\nNow a high school student, Shouya meets Shouko again for the first time in five years. Still tormented by his past actions, Shouya is determined to make amends for his mistakes and confront his trauma—even if he must face arduous obstacles along the way.",
    "cover_image_url": "https://ononougi.com/thumbs/Koe no Katachi/6ae045aa-4ea2-53c8-a8bb-9b7b477adc96.webp",
    "status": "Completed",
    "color": "#cb8e4d",
    "updated_at": "2025-06-14 15:32:05.116938+00",
    "created_at": "2025-06-14 15:14:25.698326+00",
    "mal_url": "https://myanimelist.net/manga/56805/Koe_no_Katachi"
  },
  {
    "manga_id": 164,
    "title": "Shigatsu wa Kimi no Uso",
    "descr": "At a very young age, Kousei Arima was strictly taught how to play the piano and meticulously follow the score by his mother, to the point where he dominated every competition he entered with ease. He earned the title of \"Human Metronome\" for performing almost perfectly. Every musician of his age looked up to him. However, after his mother suddenly dies, he became tone-deaf due to the shock and then disappeared, never to be seen onstage since.\n\nTwo years later, Kousei lives a monotonous life with his childhood friends Tsubaki Sawabe and Ryouta Watari supporting him. He continues to cling to music, although performing is still an impossibility for him. This is until his unexpected encounter with Kaori Miyazono, a violinist who performs freely without the dictations of a score. A story of friendship, love, music, and a single lie, Kousei's life begins to change and gain color as Kaori helps him to take up music again.",
    "cover_image_url": "https://ononougi.com/thumbs/Shigatsu wa Kimi no Uso/8bfc80b8-53fd-5735-a959-dfdbdb93b0a5.webp",
    "status": "Completed",
    "color": "#98CCF3",
    "updated_at": "2025-06-15 15:55:55.274208+00",
    "created_at": "2025-06-15 15:30:22.01966+00",
    "mal_url": "https://myanimelist.net/manga/37707/Shigatsu_wa_Kimi_no_Uso"
  },
  {
    "manga_id": 22,
    "title": "Attack On Titan",
    "descr": "Hundreds of years ago, horrifying creatures which resembled humans appeared. These mindless, towering giants, called Titans, proved to be an existential threat, as they preyed on whatever humans they could find in order to satisfy a seemingly unending appetite. Unable to effectively combat the Titans, mankind was forced to barricade themselves within large walls surrounding what may very well be humanity's last safe haven in the world.\nIn the present day, life within the walls has finally found peace, since the residents have not dealt with Titans for many years. Eren Yeager, Mikasa Ackerman, and Armin Arlert are three young children who dream of experiencing all that the world has to offer, having grown up hearing stories of the wonders beyond the walls. But when the state of tranquility is suddenly shattered by the attack of a massive 60-meter Titan, they quickly learn just how cruel the world can be. On that day, Eren makes a promise to himself that he will do whatever it takes to eradicate every single Titan off the face of the Earth, with the hope that one day, humanity will once again be able to live outside the walls without fear.",
    "cover_image_url": "https://ononougi.com/thumbs/Attack On Titan/94fc28e9-6c24-5c7b-835f-697a3d6d3533.webp",
    "status": "Completed",
    "color": "#de715f",
    "updated_at": "2025-05-22 23:31:17.946569+00",
    "created_at": "2025-05-22 23:05:05.422752+00",
    "mal_url": "https://myanimelist.net/manga/23390/Shingeki_no_Kyojin"
  },
  {
    "manga_id": 179,
    "title": "Fruits Basket",
    "descr": "Tooru Honda is an orphan with nowhere to go but a tent in the woods, until the Souma family takes her in. However, the Souma family is no ordinary family, and they hide a grave secret: when they are hugged by someone of the opposite gender, they turn into animals from the Chinese zodiac!\n\nNow, Tooru must help Kyou and Yuki Souma hide their curse from their classmates, as well as her friends Arisa Uotani and Saki Hanajima. As she is drawn further into the mysterious world of the Soumas, she meets more of the family, forging friendships along the way.\n\nBut this curse has caused much suffering; it has broken many Soumas. Despite this, Tooru may just be able to heal their hearts and soothe their souls.",
    "cover_image_url": "https://ononougi.com/thumbs/Fruits Basket/a0dfe682-1f53-5c50-93a5-0946310c53e3.webp",
    "status": "Completed",
    "color": "#FDB3D8",
    "updated_at": "2025-06-17 22:02:57.649199+00",
    "created_at": "2025-06-17 21:40:42.752621+00",
    "mal_url": "https://myanimelist.net/manga/140914/Fruits_Basket"
  },
  {
    "manga_id": 135,
    "title": "Blue Lock",
    "descr": "After reflecting on the current state of Japanese soccer, the Japanese Football Association decides to hire the enigmatic and eccentric coach Jinpachi Ego to achieve their dream of winning the World Cup. Believing that Japan has lacked an egoistic striker hungry for goals, Jinpachi initiates the Blue Lock—a prison-like facility where three hundred talented strikers from high schools all over Japan are isolated and pitted against each other. The sole survivor of Blue Lock will earn the right to become the national team's striker, and those who are defeated shall be banned from joining the team forever.\n\nSelected to join this risky project is Yoichi Isagi, a striker who failed to bring his high school soccer team to the national tournament. After choosing to pass to a teammate who missed instead of scoring on his own, he could not help but wonder if the results would have been different had he been more selfish. Using this golden opportunity given by the Blue Lock Project, Yoichi aims to clear his doubts and chase his ultimate desire—to become the greatest striker in the world and lead Japan to World Cup glory.",
    "cover_image_url": "https://ononougi.com/thumbs/Blue Lock/64f31ed3-023c-5d8a-9e7c-9ac32d9036d0.webp",
    "status": "OnGoing",
    "color": "#474D69",
    "updated_at": "2025-06-09 22:06:42.971648+00",
    "created_at": "2025-06-09 21:09:14.771816+00",
    "mal_url": "https://myanimelist.net/manga/114745/Blue_Lock"
  },
  {
    "manga_id": 165,
    "title": "Eyeshield 21",
    "descr": "Timid, diminutive, and frequently the target of bullies, Sena Kobayakawa has just enrolled at Deimon Private High School. When he angers a group of delinquents by refusing to act as their errand boy, he makes an incredibly speedy getaway, an ability he has developed through years of running from his tormentors.\n\nYouichi Hiruma—the demonic captain of the Deimon Devil Bats football team—happens to be nearby, and seeing Sena's \"golden legs\" at work, forcibly recruits him as a running back despite Sena's desire to be team manager instead. Made to don the number 21 jersey and a special helmet to hide his identity as a player, Sena becomes \"Eyeshield 21,\" the team's closely guarded secret weapon. Soon he realizes his love for the sport, and aims to help the Devil Bats reach the Christmas Bowl, the high school football championship.",
    "cover_image_url": "https://ononougi.com/thumbs/Eyeshield 21/3f43af2e-0cb2-558f-b77e-5b353b6bd54e.webp",
    "status": "Completed",
    "color": "#deab6f",
    "updated_at": "2025-06-15 16:55:32.334828+00",
    "created_at": "2025-06-15 15:51:08.367106+00",
    "mal_url": "https://myanimelist.net/manga/43/Eyeshield_21"
  },
  {
    "manga_id": 174,
    "title": "Inuyashiki",
    "descr": "Ichirou Inuyashiki is an old father worn down by the hardships of life, rendering him helpless and weak. Although he is friendless, unloved by his family, and diagnosed with cancer, he decides to try living his best life and adopts a dog. However, while walking his dog one night, the reality of his hopeless situation settles in and he breaks into sobs in a park. But that sadness is short-lived, as an encounter with an extraterrestrial object leaves him with a healthy yet mechanical body. Unsettled by the foreign body and his inability to cry anymore, Inuyashiki starts to believe he has lost his humanity.\n\nHowever, one night, he saves a homeless man from death, and the sight of the happy and grateful man moves him to tears—proving to him that he is still a human. From that moment onward, Inuyashiki resolves to put his new power to use for the purpose of saving those in need.\n\nUnfortunately, his joy does not last for long, for he finds that there is a new threat determined to revel in its own newfound power through horrifying means. Thus, Inuyashiki's mission turns from being a small-time neighborhood hero to a guardian against a thriving monster.",
    "cover_image_url": "https://ononougi.com/thumbs/Inuyashiki/916a20cf-e687-562e-84f5-34380e17911f.webp",
    "status": "Completed",
    "color": "#b7c682",
    "updated_at": "2025-06-16 11:25:37.515024+00",
    "created_at": "2025-06-16 10:55:37.243482+00",
    "mal_url": "https://myanimelist.net/manga/64465/Inuyashiki"
  },
  {
    "manga_id": 248,
    "title": "High School DxD",
    "descr": "\"Would you mind dying right now?\" are not the words that high school student and lifelong pervert Issei Hyoudou expects to hear from his first girlfriend, especially not before being brutally murdered on their first date. Luckily for Issei, he's saved when he summons the beautiful Rias Gremory, a high-ranking Devil, who reincarnates him as a Devil servant. As Issei learns more about the conflict that has raged between Devils and Angels, he discovers that his \"girlfriend\" was actually a Fallen Angel named Raynare, sent to destroy him because he possesses a \"Sacred Gear,\" a divine weapon given to humans by the Gods.\n\nIssei is then made a member of the Occult Research Club, the headquarters for the House of Gremory, where he meets the rest of Rias' servants. Given the rank \"Pawn,\" Issei decides that he will rise through the ranks so that he can create his own harem of beautiful girls. However, many grave dangers lie ahead, as Issei must face the Fallen Angels and rogue Exorcists, whilst also trying to master the power of his Sacred Gear.",
    "cover_image_url": "https://ononougi.com/thumbs/High School DxD/50e3bc66-f8b7-5fe3-8ec0-1859be4c5c6d.webp",
    "status": "Completed",
    "color": "#F1517D",
    "updated_at": "2025-06-23 18:27:45.841998+00",
    "created_at": "2025-06-23 18:10:40.494437+00",
    "mal_url": "https://myanimelist.net/manga/25409/High_School_DxD"
  },
  {
    "manga_id": 27,
    "title": "One Punch Man",
    "descr": "After rigorously training for three years, the ordinary Saitama has gained immense strength which allows him to take out anyone and anything with just one punch. He decides to put his new skill to good use by becoming a hero. However, he quickly becomes bored with easily defeating monsters, and wants someone to give him a challenge to bring back the spark of being a hero.\n\nUpon bearing witness to Saitama's amazing power, Genos, a cyborg, is determined to become Saitama's apprentice. During this time, Saitama realizes he is neither getting the recognition that he deserves nor known by the people due to him not being a part of the Hero Association. Wanting to boost his reputation, Saitama decides to have Genos register with him, in exchange for taking him in as a pupil. Together, the two begin working their way up toward becoming true heroes, hoping to find strong enemies and earn respect in the process.",
    "cover_image_url": "https://ononougi.com/thumbs/One Punch Man/6701663b-dd75-5a4b-a7ba-e06b8fa576a6.webp",
    "status": "OnGoing",
    "color": "#b5352b",
    "updated_at": "2025-05-23 14:19:22.320958+00",
    "created_at": "2025-05-23 11:51:09.756546+00",
    "mal_url": "https://myanimelist.net/manga/44347/One_Punch-Man"
  },
  {
    "manga_id": 182,
    "title": "Ping Pong",
    "descr": "Makoto Tsukimoto (nicknamed Smile) is a quiet high schooler who's been friends with the loud and energetic Yutaka Hoshino (nicknamed Peco) since childhood. They're both in the local table tennis club and both have a natural talent for it, although Smile's personality always prevents him from winning against Peco. The club teacher, however, notices Smile's talent and tries to make him gain some sportive tenacity.",
    "cover_image_url": "https://ononougi.com/thumbs/Ping Pong/c22c8711-1b74-598d-b778-d47169bb8857.webp",
    "status": "Completed",
    "color": "#009dbc",
    "updated_at": "2025-06-17 22:31:56.004203+00",
    "created_at": "2025-06-17 22:22:16.636197+00",
    "mal_url": "https://myanimelist.net/manga/5744/Ping_Pong"
  },
  {
    "manga_id": 172,
    "title": "Rurouni Kenshin: Meiji Kenkaku Romantan",
    "descr": "Ten years have passed since the end of Bakumatsu, an era of war that saw the uprising of citizens against the Tokugawa shogunate. The revolutionaries wanted to create a time of peace, and a thriving country free from oppression. The new age of Meiji has come, but peace has not yet been achieved. Swords are banned but people are still murdered in the streets. Orphans of war veterans are left with nowhere to go, while the government seems content to just line their pockets with money.\n\nOne wandering samurai, Kenshin Himura, still works to make sure the values he fought for are worth the lives spent to bring about the new era. Once known as Hitokiri Battousai, he was feared as the most ruthless killer of all the revolutionaries. Now haunted by guilt, Kenshin has sworn never to kill again in atonement for the lives he took, and he may never know peace until killing is a thing of the past.\n\nNow in the 11th year of Meiji, Kenshin stumbles upon Kaoru Kamiya, owner and head instructor of a small dojo being threatened to close its doors. The police force is powerless to stop the string of murders done in the name of her dojo by a man claiming to be the famous Battousai. Kenshin's wanderings pause for now as he joins Kaoru to clear both their names. But how long can he stay before his past catches up to him?",
    "cover_image_url": "https://ononougi.com/thumbs/Rurouni Kenshin Meiji Kenkaku Romantan/d75ba897-f2d3-5864-b55c-dc37a06229b1.webp",
    "status": "Completed",
    "color": "#ea5813",
    "updated_at": "2025-06-15 22:27:34.148208+00",
    "created_at": "2025-06-15 21:02:19.974345+00",
    "mal_url": "https://myanimelist.net/manga/22/Rurouni_Kenshin__Meiji_Kenkaku_Romantan"
  },
  {
    "manga_id": 250,
    "title": "Mao",
    "descr": "Nanoka passes through a portal into the Taisho era, where exorcist Mao reluctantly rescues her from the jaws of a grotesque yokai. When Nanoka gets back to the present, she discovers she has some new, incredible abilities. She returns to the past looking for answers, only to get caught up in Mao's investigation of a series of gruesome murders. As her questions about herself multiply, Nanoka learns that Mao is cursed by a cat demon named Byoki—and so is his sword. If anyone but Mao attempts to wield it, they are doomed. But when Mao's life is in jeopardy, Nanoka picks up his blade and swings!",
    "cover_image_url": "https://ononougi.com/thumbs/Mao/d147f07a-3fb3-59a7-b9f3-3b3384dc5787.webp",
    "status": "OnGoing",
    "color": "#e92028",
    "updated_at": "2025-06-23 22:53:26.539578+00",
    "created_at": "2025-06-23 18:32:18.656567+00",
    "mal_url": "https://myanimelist.net/manga/119588/Mao"
  },
  {
    "manga_id": 183,
    "title": "Naruto",
    "descr": "Whenever Naruto Uzumaki proclaims that he will someday become the Hokage—a title bestowed upon the best ninja in the Village Hidden in the Leaves—no one takes him seriously. Since birth, Naruto has been shunned and ridiculed by his fellow villagers. But their contempt isn't because Naruto is loud-mouthed, mischievous, or because of his ineptitude in the ninja arts, but because there is a demon inside him. Prior to Naruto's birth, the powerful and deadly Nine-Tailed Fox attacked the village. In order to stop the rampage, the Fourth Hokage sacrificed his life to seal the demon inside the body of the newborn Naruto.\n\nAnd so when he is assigned to Team 7—along with his new teammates Sasuke Uchiha and Sakura Haruno, under the mentorship of veteran ninja Kakashi Hatake—Naruto is forced to work together with other people for the first time in his life. Through undergoing vigorous training and taking on challenging missions, Naruto must learn what it means to work in a team and carve his own route toward becoming a full-fledged ninja recognized by his village.",
    "cover_image_url": "https://ononougi.com/thumbs/Naruto/9c5aa815-01fa-5a36-9ea4-b8a79881c045.webp",
    "status": "Completed",
    "color": "#FC521F",
    "updated_at": "2025-06-18 19:31:37.174234+00",
    "created_at": "2025-06-18 17:11:45.675221+00",
    "mal_url": "https://myanimelist.net/manga/11/Naruto"
  },
  {
    "manga_id": 194,
    "title": "Tokyo Ghoul",
    "descr": "Lurking within the shadows of Tokyo are frightening beings known as ghouls, who satisfy their hunger by feeding on humans once night falls. An organization known as the Commission of Counter Ghoul (CCG) has been established in response to the constant attacks on citizens and as a means of purging these creatures. However, the problem lies in identifying ghouls as they disguise themselves as humans, living amongst the masses so that hunting prey will be easier. Ken Kaneki, an unsuspecting university freshman, finds himself caught in a world between humans and ghouls when his date turns out to be a ghoul after his flesh.\n\nBarely surviving this encounter after being taken to a hospital, he discovers that he has turned into a half-ghoul as a result of the surgery he received. Unable to satisfy his intense craving for human meat through conventional means, Kaneki is taken in by friendly ghouls who run a coffee shop in order to help him with his transition. As he begins what he thinks will be a peaceful new life, little does he know that he is about to find himself at the center of a war between his new comrades and the forces of the CCG, and that his new existence has caught the attention of ghouls all over Tokyo.",
    "cover_image_url": "https://ononougi.com/thumbs/Tokyo Ghoul/d3b2227a-0aee-54e1-8d78-ab6721f761fe.webp",
    "status": "Completed",
    "color": "#519b96",
    "updated_at": "2025-06-19 02:00:57.304331+00",
    "created_at": "2025-06-19 01:33:30.67294+00",
    "mal_url": "https://myanimelist.net/manga/74847/Tokyo_Ghoul"
  },
  {
    "manga_id": 195,
    "title": "Tokyo Ghoul:re",
    "descr": "Two years have passed since the CCG's raid on Anteiku. Although the atmosphere in Tokyo has changed drastically due to the increased influence of the CCG, ghouls continue to pose a problem as they have begun taking caution, especially the terrorist organization Aogiri Tree, who acknowledge the CCG's growing threat to their existence.\n\nThe creation of a special team, known as the Quinx Squad, may provide the CCG with the push they need to exterminate Tokyo's unwanted residents. As humans who have undergone surgery in order to make use of the special abilities of ghouls, they participate in operations to eradicate the dangerous creatures. The leader of this group, Haise Sasaki, is a half-ghoul, half-human who has been trained by famed special class investigator, Kishou Arima. However, there's more to this young man than meets the eye, as unknown memories claw at his mind, slowly reminding him of the person he used to be.",
    "cover_image_url": "https://ononougi.com/thumbs/Tokyo Ghoulre/f8a9d751-87bc-583c-8e71-f3b5492f2ab5.webp",
    "status": "Completed",
    "color": "#074998",
    "updated_at": "2025-06-19 11:14:36.974506+00",
    "created_at": "2025-06-19 10:39:54.572269+00",
    "mal_url": "https://myanimelist.net/manga/81117/Tokyo_Ghoul_re"
  },
  {
    "manga_id": 223,
    "title": "Sakamoto Days",
    "descr": "Tarou Sakamoto was considered the greatest hitman of all time. Feared by many, he stood at the top of the underground world until he met and fell in love with a woman. As a result, Sakamoto abandoned his life of crime and now works as a convenience store clerk.\n\nLeaving his shady past behind proves more difficult than Sakamoto initially imagined. Many of his former rivals and partners do not believe that he has truly left the business and show up in hopes of taking him out. Barred from killing, Sakamoto must find creative ways to subdue his enemies and prevent them from bringing harm to his family, his store, and the small town he resides in.",
    "cover_image_url": "https://ononougi.com/thumbs/Sakamoto Days/3377f22a-17ce-5e78-858b-b8d33b2860db.webp",
    "status": "OnGoing",
    "color": "#cb9f45",
    "updated_at": "2025-06-20 18:10:50.422378+00",
    "created_at": "2025-06-20 17:18:36.064166+00",
    "mal_url": "https://myanimelist.net/manga/131334/Sakamoto_Days"
  },
  {
    "manga_id": 251,
    "title": "Chobits",
    "descr": "After enduring four years of high school, Hideki Motosuwa strives to get into the university of his choice by attending cram school in Tokyo. Concurrently, he works daily shifts at a bar to make ends meet, thus missing out on the world's latest invention—human-like computers called Persocoms. Longing for a persocom of his own, Hideki is met with a stroke of luck when he stumbles upon a cute abandoned persocom in a garbage pile.\n\nUpon finding the power button, Hideki finds his newfound robot to be faulty and only capable of uttering the word \"Chii\"—which Hideki decides to name her after. Chii, however, is no ordinary persocom: capable of thinking and learning on her own, she is a legendary type of robot known as a Chobit. Now, it is up to Hideki to teach Chii how to live an ordinary life and to uncover the truth behind the elusive chobits series.",
    "cover_image_url": "https://ononougi.com/thumbs/Chobits/934c5cf3-9a6f-576c-a6fa-e86184902353.webp",
    "status": "Completed",
    "color": "#4da1c8",
    "updated_at": "2025-06-23 19:04:47.568523+00",
    "created_at": "2025-06-23 18:40:04.126552+00",
    "mal_url": "https://myanimelist.net/manga/107/Chobits"
  },
  {
    "manga_id": 225,
    "title": "Aku no Hana",
    "descr": "Takao Kasuga is an unsociable middle school student who bears a love for books—in particular, Charles Baudelaire's Les Fleurs du Mal. He also has a crush on his class' idol, the sweet Nanako Saeki. In stark contrast to her, Sawa Nakamura is an insolent and unpleasant girl who lacks any concern for school.\n\nOne day, Takao forgets to bring his book home with him. He returns to school to retrieve it, but is stopped in his tracks when he finds Nanako's freshly worn gym clothes lying on the floor. A strange desire consumes Takao, and like a wicked pervert, he steals them.\n\nWith the guilt of his crime weighing on him, Takao tries his best to live a normal life. Sawa, however, who witnessed Takao's thievery, has other plans in store for him...",
    "cover_image_url": "https://ononougi.com/thumbs/Aku no Hana/c86c547e-7ac9-5be6-9294-836c120d5a03.webp",
    "status": "Completed",
    "color": "#e34db3",
    "updated_at": "2025-06-20 18:44:19.244498+00",
    "created_at": "2025-06-20 18:21:00.366139+00",
    "mal_url": "https://myanimelist.net/manga/24705/Aku_no_Hana"
  },
  {
    "manga_id": 281,
    "title": "Takopii no Genzai",
    "descr": "A squid-like creature, known as a Happian, leaves his home planet with the desire to spread happiness across the universe. He lands on Earth, but quickly finds himself in danger of captivity by its inhabitants. Fortunately, he is found by an unsmiling little girl named Shizuka Kuze, who feeds him and names him Takopii. Feeling indebted, Takopii decides to do everything in his power to bring a smile to her face.\n\nThe task is easier said than done, however. Shizuka is bullied by her classmates, she does not have a father, and her mother is never home—though the gravity of these issues flies over the naive Takopii's head. Even so, Shizuka does have one source of happiness: her dog Chappy. The connection Shizuka and Chappy share only increases Takopii's desire to make the girl smile.\n\nWhile Takopii's attempts to lift Shizuka's spirits lead to unintended consequences, he is determined to take things into his own tentacles, test his understanding of human beings, and achieve his goal of spreading happiness.",
    "cover_image_url": "https://ononougi.com/thumbs/Takopii no Genzai/fd95e173-1a8f-535b-85e3-9f3e68c5312a.webp",
    "status": "Completed",
    "color": "#e34685",
    "updated_at": "2025-07-13 20:24:21.777513+00",
    "created_at": "2025-07-13 20:20:08.078243+00",
    "mal_url": "https://myanimelist.net/manga/142600/Takopii_no_Genzai"
  },
  {
    "manga_id": 226,
    "title": "Gantz:E",
    "descr": "A peasant named Hanbei asks a girl named O-haru for her hand in marriage, but O-haru confesses that she is already thinking of another man named Masakichi from a neighboring village. When Hanbei seeks out Masakichi, he finds that Masakichi possesses a sword and the skills to use it, despite being a peasant.",
    "cover_image_url": "https://ononougi.com/thumbs/GantzE/0fb4972c-f8f2-5cd2-a690-c268b983fc7f.webp",
    "status": "OnGoing",
    "color": "#ca141e",
    "updated_at": "2025-06-20 19:28:57.726447+00",
    "created_at": "2025-06-20 18:46:18.73515+00",
    "mal_url": "https://myanimelist.net/manga/123754/Gantz_E"
  },
  {
    "manga_id": 19,
    "title": "Spy X Family",
    "descr": "For the agent known as \"Twilight,\" no order is too tall if it is for the sake of peace. Operating as Westalis' master spy, Twilight works tirelessly to prevent extremists from sparking a war with neighboring country Ostania. For his latest mission, he must investigate Ostanian politician Donovan Desmond by infiltrating his son's school: the prestigious Eden Academy. Thus, the agent faces the most difficult task of his career: get married, have a child, and play family.\n\nTwilight, or \"Loid Forger,\" quickly adopts the unassuming orphan Anya to play the role of a six-year-old daughter and prospective Eden Academy student. For a wife, he comes across Yor Briar, an absent-minded office worker who needs a pretend partner of her own to impress her friends. However, Loid is not the only one with a hidden nature. Yor moonlights as the lethal assassin \"Thorn Princess.\" For her, marrying Loid creates the perfect cover. Meanwhile, Anya is not the ordinary girl she appears to be; she is an esper, the product of secret experiments that allow her to read minds. Although she uncovers their true identities, Anya is thrilled that her new parents are cool secret agents! She would never tell them, of course. That would ruin the fun.\n\nUnder the guise of \"The Forgers,\" the spy, the assassin, and the esper must act as a family while carrying out their own agendas. Although these liars and misfits are only playing parts, they soon find that family is about far more than blood relations.",
    "cover_image_url": "https://ononougi.com/thumbs/Spy X Family/3e9fee1c-2e05-502c-b86c-b670afb78ee9.webp",
    "status": "OnGoing",
    "color": "#93A396",
    "updated_at": "2025-05-22 20:09:02.074397+00",
    "created_at": "2025-05-22 19:41:05.297183+00",
    "mal_url": "https://myanimelist.net/manga/119161/Spy_x_Family"
  },
  {
    "manga_id": 42,
    "title": "Dr. Stone",
    "descr": "When a mysterious light suddenly engulfs Earth, humanity is left petrified, frozen in stone. Thousands of years later, the world is teeming with vegetation, and forests have taken the places of cities that once stood proudly. One of the very first to emerge from their stone prison is Taiju Ooki, who finds that his good friend, a brilliant young scientist named Senkuu, has been preparing for his awakening. While Taiju wishes to save the girl he loves, Senkuu is determined to figure out the cause behind the strange phenomenon and restore the world to its former glory.\n\nBut when they free the infamously powerful Tsukasa Shishiou in order to gain an upper hand against the dangers in an unfamiliar world, they realize that their new comrade has other plans. Tsukasa sees their predicament as a chance to start over; free from the corruption and destruction wrought by technology, he will stop at nothing to achieve his goals. With both sides unable to see eye to eye, Senkuu and his devotion to science will clash with Tsukasa and his primal nature in what will truly be a battle of the ages.",
    "cover_image_url": "https://ononougi.com/thumbs/Dr. Stone/0b67f71d-1c80-5dbb-a500-b8fce96656f4.webp",
    "status": "Completed",
    "color": "#b8ad8a",
    "updated_at": "2025-05-25 23:46:17.686715+00",
    "created_at": "2025-05-25 22:44:42.48014+00",
    "mal_url": "https://myanimelist.net/manga/103897/Dr_Stone"
  },
  {
    "manga_id": 227,
    "title": "Hunter x Hunter",
    "descr": "\"Secret treasure hoards, undiscovered wealth... mystical places, unexplored frontiers... 'The mysterious unknown.' There's magic in such words for those captivated by its spell. They are called 'Hunters'!\"\n\nGon Freecss wants to become a Hunter so he can find his father, a man who abandoned him to pursue a life of adventure. But it's not that simple: only one in one hundred thousand can pass the Hunter Exam, and that is just the first obstacle on his journey. During the Hunter Exam, Gon befriends many other potential Hunters, such as the mysterious Killua; the revenge-driven Kurapika; and Leorio, who aims to become a doctor. There's a world of adventure and peril awaiting, and those who embrace it with open arms can become the greatest Hunters of them all!",
    "cover_image_url": "https://ononougi.com/thumbs/Hunter x Hunter/c0fb7d50-9109-5bc9-b10f-0dfc443e0734.webp",
    "status": "OnGoing",
    "color": "#7BC045",
    "updated_at": "2025-06-20 20:50:17.716186+00",
    "created_at": "2025-06-20 19:53:35.939799+00",
    "mal_url": "https://myanimelist.net/manga/26/Hunter_x_Hunter"
  },
  {
    "manga_id": 76,
    "title": "H.P. Lovecraft's the Call of Cthulhu",
    "descr": "H.P. Lovecraft's most famous horror story, rendered in chilling detail by modern manga horror master Gou Tanabe!\n\nThe complete graphic novel in one volume, faithfully reproducing the original Japanese release, featuring a title page in silver ink, eight pages in full color, and eerie metallic copper tones and spot color on the cover.\n\nWhat links together two bands of worshippers, one deep in the Arctic snows, one hidden in the bayous of Louisiana, is more than their shared practice of blood sacrifice.\n\nIt is the inhuman phrase they both chant: Ph'nglui mglw'nafh Cthulhu R'lyeh wgah'nagl fhtagn--\"In his house at R'lyeh dead Cthulhu waits dreaming.\" Now these nightmares will disturb the sanity of Francis Thurston, a young man pursuing an investigation into the cult of Cthulhu that leads to the most forsaken spot in the vast Pacific...and to Earth's supreme terror, the risen corpse-city of R'lyeh.\n\nFirst published in 1928, The Call of Cthulhu, rendered in chilling detail by modern manga horror master Gou Tanabe, is the most famous of all of H.P. Lovecraft's stories, and was the namesake of the acclaimed role-playing game system set within the Cthulhu Mythos.\n\n\"I love H.P. Lovecraft...It would be great to adapt him as a serialized manga, but I actually saw Gou Tanabe create a great adaption of H.P. Lovecraft's stories. Afterwards, I ended up not doing it because I thought I wouldn't be as good as Gou's version.\"-- Junji Ito (Uzumaki, Black Paradox)",
    "cover_image_url": "https://ononougi.com/thumbs/H.P. Lovecraft's the Call of Cthulhu/6aa6d716-c41d-5185-9c4b-6384c4fbee0e.webp",
    "status": "Completed",
    "color": "#bd743d",
    "updated_at": "2025-06-02 21:24:18.511375+00",
    "created_at": "2025-06-02 21:11:19.896708+00",
    "mal_url": "https://myanimelist.net/manga/128677/Cthulhu_no_Yobigoe__Lovecraft_Kessakushuu"
  },
  {
    "manga_id": 59,
    "title": "Yakusoku no Neverland",
    "descr": "At Grace Field House, life could not be better for the orphans! Though they have no parents, together with the other kids and a kind \"Mama\" who cares for them, they form one big happy family. No child is ever overlooked, especially since they are all adopted by the age of 12. Their daily lives involve rigorous tests, but afterward, they are allowed to play outside.\n\nThere is only one rule they must obey: do not leave the orphanage. But one day, two top-scoring orphans, Emma and Norman, venture past the gate and unearth the harrowing secret behind their entire existence. Utilizing their quick-wittedness, the children must work together to somehow change their predetermined fate.",
    "cover_image_url": "https://ononougi.com/thumbs/Yakusoku no Neverland/47eb5445-5a93-5da0-8645-6caa7f5dafcd.webp",
    "status": "Completed",
    "color": "#EB6607",
    "updated_at": "2025-05-29 01:22:41.610887+00",
    "created_at": "2025-05-29 00:52:06.163811+00",
    "mal_url": "https://myanimelist.net/manga/100128/Yakusoku_no_Neverland"
  },
  {
    "manga_id": 57,
    "title": "Vinland Saga",
    "descr": "Thorfinn, son of one of the Vikings' greatest warriors, is among the finest fighters in the merry band of mercenaries run by the cunning Askeladd, an impressive feat for a person his age. However, Thorfinn is not part of the group for the plunder it entails—instead, for having caused his family great tragedy, the boy has vowed to kill Askeladd in a fair duel. Not yet skilled enough to defeat him, but unable to abandon his vengeance, Thorfinn spends his boyhood with the mercenary crew, honing his skills on the battlefield among the war-loving Danes, where killing is just another pleasure of life.\n\nOne day, when Askeladd receives word that Danish prince Canute has been taken hostage, he hatches an ambitious plot—one that will decide the next King of England and drastically alter the lives of Thorfinn, Canute, and himself. Set in 11th-century Europe, Vinland Saga tells a bloody epic in an era where violence, madness, and injustice are inescapable, providing a paradise for the battle-crazed and utter hell for the rest who live in it.",
    "cover_image_url": "https://ononougi.com/thumbs/Vinland Saga/52de64a0-cba7-53e2-a68c-758ba77c5bd0.webp",
    "status": "OnGoing",
    "color": "#d19077",
    "updated_at": "2025-06-04 12:28:19.172545+00",
    "created_at": "2025-05-28 22:14:01.143875+00",
    "mal_url": "https://myanimelist.net/manga/642/Vinland_Saga"
  },
  {
    "manga_id": 60,
    "title": "Homunculus",
    "descr": "Susumu Nakoshi is a middle-aged man who spends his days between a lavish first-class hotel and a park full of homeless people. One day, an eccentric young man approaches Nakoshi in search of subjects willing to partake in trepanation—the procedure of drilling a hole in the skull.\n\nThis mysterious person claims that Nakoshi is the perfect man for the experiment. Initially rejecting the offer, he doubles back on his decision after his car gets towed off. Nakoshi agrees to let Manabu Ito, a 22-year-old medical student, drill a hole in his skull in exchange for 700,000 yen. The procedure bears no results at first, with Nakoshi showing no abnormalities. This normalcy comes to an abrupt end, however, when Nakoshi begins seeing the homunculus in every person. With his perception distorted, how will Nakoshi face these homunculi?",
    "cover_image_url": "https://ononougi.com/thumbs/Homunculus/970f8269-8e37-541f-b5a8-b575ad496977.webp",
    "status": "Completed",
    "color": "#b72c34",
    "updated_at": "2025-05-29 10:47:56.297568+00",
    "created_at": "2025-05-29 10:19:38.060098+00",
    "mal_url": "https://myanimelist.net/manga/936/Homunculus"
  },
  {
    "manga_id": 63,
    "title": "Kakegurui",
    "descr": "Hyakkaou Private Academy is a school for the privileged and influential, playing host to the children of businessmen and politicians. However, unlike other schools, students at Hyakkaou do not pride themselves on academic achievement. Instead, they value strategic prowess and the ability to read people. Come nightfall, many places on campus transform into gambling dens overseen by the student council, where players compete for rank, money, and more.\n\nRyouta Suzui spends his days as a \"house pet\"—a student ranked in the bottom one hundred, forced to serve his peers. His circumstances soon change when a mysterious new transfer student, Yumeko Jabami, arrives at the academy. Despite Suzui's warnings, Yumeko quickly becomes immersed in the school's gambling scene, facing off against several high-profile opponents. Her exploits draw the attention of the student council members, who start meddling in her affairs. Suzui tries his best to keep Yumeko out of trouble, but to his chagrin, she turns out to be the type of person best suited to attend Hyakkaou: a compulsive gambler.",
    "cover_image_url": "https://ononougi.com/thumbs/Kakegurui/bca3bae3-0a19-5a6d-a566-aed0ad19a9f8.webp",
    "status": "OnGoing",
    "color": "#d02018",
    "updated_at": "2025-06-02 22:12:55.111694+00",
    "created_at": "2025-05-29 21:52:52.751297+00",
    "mal_url": "https://myanimelist.net/manga/73603/Kakegurui"
  },
  {
    "manga_id": 82,
    "title": "Jujutsu Kaisen",
    "descr": "Hidden in plain sight, an age-old conflict rages on. Supernatural monsters known as Curses terrorize humanity from the shadows, and powerful humans known as Jujutsu sorcerers use mystical arts to exterminate them. When high school student Yuuji Itadori finds a dried-up finger of the legendary Curse Sukuna Ryoumen, he suddenly finds himself joining this bloody conflict.\n\nAttacked by a Curse attracted to the finger's power, Yuuji makes a reckless decision to protect himself, gaining the power to combat Curses in the process but also unwittingly unleashing the malicious Sukuna into the world once more. Though Yuuji can control and confine Sukuna to his own body, the Jujutsu world classifies Yuuji as a dangerous, high-level Curse who must be exterminated.\n\nDetained and sentenced to death, Yuuji meets Satoru Gojou—a teacher at Jujutsu High School—who explains that despite his imminent execution, there is an alternative for him. Being a rare vessel to Sukuna, if Yuuji were to die, then Sukuna would perish too. Therefore, if Yuuji were to consume the many other remnants of Sukuna, then Yuuji's subsequent execution would truly eradicate the malicious demon. Taking up this chance to make the world safer and live his life for a little longer, Yuuji enrolls in Tokyo Prefectural Jujutsu High School, jumping headfirst into a harsh and unforgiving battlefield.",
    "cover_image_url": "https://ononougi.com/thumbs/Jujutsu Kaisen/732accf0-f129-564c-88d7-f063ad0d6a79.webp",
    "status": "Completed",
    "color": "#0c969b",
    "updated_at": "2025-06-03 23:31:28.454239+00",
    "created_at": "2025-06-03 22:51:39.50802+00",
    "mal_url": "https://myanimelist.net/manga/113138/Jujutsu_Kaisen"
  },
  {
    "manga_id": 65,
    "title": "Love Hina",
    "descr": "It is said that if a couple gets into the University of Tokyo together, they will live happily ever after. However, for Keitarou Urashima, UTokyo is a distant dream. After failing the entrance exams twice already, he decides to stay at his grandmother's inn in Tokyo in order to prepare for his third attempt. He is, therefore, surprised when he finds out that not only has his grandmother gone on a long vacation, but the inn has also become the Hinata House, an all-girls dormitory!\n\nUnfortunately for Keitarou, a series of misunderstandings during his first visit leave him with five untrusting tenants. But when Haruka Urashima, his aunt who works at the dorm, brings up that he is supposedly a UTokyo student, the girls' impressions of him quickly change, and they reluctantly allow him to stay. Feeling guilty about the lie, he slowly gets to know his new neighbors: the cute yet violent Naru Narusegawa, the cheeky and opportunistic Mitsune Konno, the soft-spoken Shinobu Maehara, the straight-laced Motoko Aoyama, and the mischievous Kaolla Su.\n\nThus continues the unpopular Keitarou's difficult journey to get into UTokyo, all for the chance to fulfill his childhood promise to the only girl who has ever shown any interest in him and maybe, just maybe, meet her again.",
    "cover_image_url": "https://ononougi.com/thumbs/Love Hina/93a09e9a-d8b2-5c0e-b137-37d8c7d1a24d.webp",
    "status": "Completed",
    "color": "#816BAE",
    "updated_at": "2025-06-01 17:01:02.368311+00",
    "created_at": "2025-05-31 21:51:23.374425+00",
    "mal_url": "https://myanimelist.net/manga/16/Love_Hina"
  },
  {
    "manga_id": 232,
    "title": "Orange",
    "descr": "One morning, Naho Takamiya receives a letter in the mail claiming to be from herself 10 years in the future. The letter reveals a series of events that are supposed to take place that day. At first, Naho thinks it's just a prank; but when the letter mentions a transfer student named Kakeru Naruse, who really ends up transferring into her class later that day, she is forced to believe in its contents.\n\nAs Naho continues to read the letter, her future self mentions several regrets, urging Naho to take the right decisions now. Somehow these regrets all seem to be connected to Kakeru, and with the burden of the knowledge that the boy wouldn't be with her and her friends in the future, will Naho be able to make the perfect choices that will alter what seems to be fate?",
    "cover_image_url": "https://ononougi.com/thumbs/Orange/71dbda40-2141-5680-8ef9-2b5bd4732fc5.webp",
    "status": "Completed",
    "color": "#be7f66",
    "updated_at": "2025-06-21 23:11:15.531361+00",
    "created_at": "2025-06-21 22:51:14.062662+00",
    "mal_url": "https://myanimelist.net/manga/35573/Orange"
  },
  {
    "manga_id": 233,
    "title": "Suzumiya Haruhi no Yuuutsu",
    "descr": "Kyon is your ordinary high school freshman who has long given up on his childhood dreams of encountering the fantastic and supernatural…or so he thought. From the very first day of school, his classmate–the beautiful but eccentric Haruhi Suzumiya–makes it very clear that her only desire is to meet aliens, time travelers, and psychics! A chance conversation between the two inspires Haruhi to form the SOS Brigade, a school club created for the sole purpose of getting these supernatural beings together. The initial members consist of the mute bookworm Yuki Nagato, the timid but voluptuous Mikuru Asahina, and the polite and ever-smiling Itsuki Koizumi. By the end of this first volume, Kyon quickly finds out that these seemingly \"helpless victims\" of Haruhi's are actually members of secret organizations–both futuristic and alien–keeping watch over Haruhi as she is the pinnacle of some major calamity on the horizon…",
    "cover_image_url": "https://ononougi.com/thumbs/Suzumiya Haruhi no Yuuutsu/3246262b-1c2e-5739-b0ce-0b52238d1402.webp",
    "status": "Completed",
    "color": "#d4242b",
    "updated_at": "2025-06-22 13:50:20.699941+00",
    "created_at": "2025-06-22 13:31:56.830965+00",
    "mal_url": "https://myanimelist.net/manga/1345/Suzumiya_Haruhi_no_Yuuutsu"
  },
  {
    "manga_id": 156,
    "title": "Made in Abyss",
    "descr": "The Abyss, a hole of unprecedented depth—one young girl and a robot brave its dangers to find the truth.\n\nThe town of Orth is a special one, as it is built around the edges of the massive Abyss, a wonder which has never been fully explored. Those who venture too far down never return, but those brave enough to traverse its territories are known as \"Cave Raiders\" and are heralded as legends. Within this town lives a young girl called Riko, the child of one of the most famous Cave Raiders of all time who disappeared on an expedition many years ago.\n\nOne day, Riko's life changes when she meets a strange robot called Reg, who seems to appear from within the Abyss. Believing this to be a sign from her mother stuck at the bottom of the Abyss, Riko descends into its depths with Reg, ready to confront all the dangers within it.",
    "cover_image_url": "https://ononougi.com/thumbs/Made in Abyss/fa37a00d-cc43-5d9b-b170-bf9e93c0fd57.webp",
    "status": "OnGoing",
    "color": "#90D5EF",
    "updated_at": "2025-06-15 01:00:24.89671+00",
    "created_at": "2025-06-15 00:31:44.346436+00",
    "mal_url": "https://myanimelist.net/manga/91941/Made_in_Abyss"
  },
  {
    "manga_id": 234,
    "title": "Toradora!",
    "descr": "Takasu Ryuuji has learned the hard way that appearances can be deceiving. For despite his inwardly sweet personality, his unintentionally sharp gaze and aggressive features give him the air of a delinquent thug, putting his chances at making new friends, let alone a girlfriend, next to zero.\n\nIt's Ryuuji's first day of his second year of high school and it seems as if things are looking up. He gets to sit in between his only friend, Yuusaku, and more importantly, the girl he's secretly crushing on, Kushieda Minori. But just when he thinks the stars are aligned in his favor, he unwittingly crosses the most feared girl in school, Aisaka Taiga, making her into his arch enemy. To top it off, Taiga has moved in right next door to Ryuuji and happens to be Minori's best friend! Can this school year possibly get any worse?!",
    "cover_image_url": "https://ononougi.com/thumbs/Toradora!/00b8d4fb-d981-5b52-91a2-e90a789a1c70.webp",
    "status": "OnGoing",
    "color": "#f6e231",
    "updated_at": "2025-06-22 16:50:52.479993+00",
    "created_at": "2025-06-22 16:28:17.857836+00",
    "mal_url": "https://myanimelist.net/manga/4368/Toradora"
  },
  {
    "manga_id": 199,
    "title": "Koukaku Kidoutai: The Human Algorithm",
    "descr": "Hackers attempt to assassinate a politician during a speech preaching the advantages of cybernetic prosthetics. Fortunately, Togusa is there to whisk her to safety, and the investigation leads Batou to a suspicious factory in the artificial islands in southern Japan. Meanwhile, Chief Aramaki hears of a disturbing discovery at the other end of the country: dozens of artificial bodies, illegally dumped near a village where an anti-cyberization sect conducts their training and \"rites.\" Among the empty shells is one formerly inhabited by the woman who embodied Section 9 until she left it behind and disappeared: Major Motoko Kusanagi...",
    "cover_image_url": "https://ononougi.com/thumbs/Koukaku Kidoutai The Human Algorithm/8d219ce4-3b14-5cdd-89b2-c4c9eb0cdf7f.webp",
    "status": "OnGoing",
    "color": "#f8ee13",
    "updated_at": "2025-06-19 15:27:47.375023+00",
    "created_at": "2025-06-19 14:07:58.669299+00",
    "mal_url": "https://myanimelist.net/manga/121505/Koukaku_Kidoutai__The_Human_Algorithm"
  },
  {
    "manga_id": 235,
    "title": "Dororo",
    "descr": "After the cruel lord Daigo Kagemitsu sells his newborn son's body parts to 48 demons in exchange for power, he casts what remains down a river and quickly forgets about his son, soon establishing a mighty kingdom. Little does Daigo know that his child survives, possessing advanced spiritual senses that allow him to navigate the world without eyes, ears, limbs, or even a voice.\n\nA brilliant doctor rescues the son and raises him as his own, naming him Hyakkimaru and fitting him with advanced prosthetics that make it possible for him to move and fight. However, tragedy strikes when Hyakkimaru turns out to be a beacon that brings demons into the doctor's home, and the doctor eventually has to send Hyakkimaru out into the world.\n\nAmid his travels, Hyakkimaru learns that slaying demons allow him to recover his missing parts and seeks to kill enough to make himself whole. He soon encounters Dororo—a boy claiming to be the world's greatest thief—who joins Hyakkimaru against his will in hopes of one day obtaining his sword. Together, the duo travels through a countryside infested with both demons and brutal men, who might prove to be worse.",
    "cover_image_url": "https://ononougi.com/thumbs/Dororo/1b5120df-9cc3-540c-8540-aadd43460f8c.webp",
    "status": "Completed",
    "color": "#F6ACA5",
    "updated_at": "2025-06-22 16:48:55.948015+00",
    "created_at": "2025-06-22 16:42:16.037722+00",
    "mal_url": "https://myanimelist.net/manga/1658/Dororo"
  },
  {
    "manga_id": 239,
    "title": "Seishun Buta Yarou wa Bunny Girl Senpai no Yume wo Minai",
    "descr": "During a visit to the local library, Sakuta Azusagawa unexpectedly witnesses a bunny girl roaming the halls—only to be further surprised when that bunny girl turns out to be his celebrity upperclassman Mai Sakurajima. When Sakuta realizes that only he can see her, he jumps at the opportunity to help.\n\nMai's enigmatic problem reminds Sakuta of both his own struggles and those of his sister. Each of these are cases of \"Adolescence Syndrome,\" a supernatural condition that warps the lives of teenagers in mysterious ways. As Mai's condition worsens, Sakuta searches for the reason behind her gradual disappearance from the public eye while she still has a chance of recovery.",
    "cover_image_url": "https://ononougi.com/thumbs/Seishun Buta Yarou wa Bunny Girl Senpai no Yume wo Minai/4cc9a541-0fd6-59d2-8848-ad1a02f2a2dd.webp",
    "status": "Completed",
    "color": "#188ec1",
    "updated_at": "2025-06-22 22:01:14.292542+00",
    "created_at": "2025-06-22 21:58:01.134778+00",
    "mal_url": "https://myanimelist.net/manga/92182/Seishun_Buta_Yarou_wa_Bunny_Girl_Senpai_no_Yume_wo_Minai"
  },
  {
    "manga_id": 240,
    "title": "Seishun Buta Yarou wa Petit Devil Kouhai no Yume wo Minai",
    "descr": "Sakuta may have cured Mai's Adolescence Syndrome in the nick of time, but now he faces a no less harrowing task-convincing her to officially date him. After managing to win that round of verbal fencing, he gets some well-deserved rest...only to wake up \"yesterday,\" with all his progress reset. This inexplicable phenomenon seems to be centered on Tomoe Koga, and the only cure is to...pretend to be her boyfriend?!",
    "cover_image_url": "https://ononougi.com/thumbs/Seishun Buta Yarou wa Petit Devil Kouhai no Yume wo Minai/6deda23e-445a-511b-8c6d-9abb50f79314.webp",
    "status": "Completed",
    "color": "#b19765",
    "updated_at": "2025-06-22 22:15:12.003792+00",
    "created_at": "2025-06-22 22:13:15.744871+00",
    "mal_url": "https://myanimelist.net/manga/116482/Seishun_Buta_Yarou_wa_Petit_Devil_Kouhai_no_Yume_wo_Minai"
  }
]